{
  "scrape_settings": {
    "n_results": "all",
    "style": "structured",
    "url": "https://www.reddit.com/r/CredibleDefense/comments/1edeq4c/credibledefense_daily_megathread_july_27_2024/"
  },
  "data": {
    "submission_metadata": {
      "author": "u/AutoModerator",
      "created_utc": "2024-07-27 05:00:12",
      "distinguished": null,
      "edited": false,
      "is_original_content": false,
      "is_self": true,
      "link_flair_text": null,
      "locked": false,
      "nsfw": false,
      "num_comments": 155,
      "permalink": "/r/CredibleDefense/comments/1edeq4c/credibledefense_daily_megathread_july_27_2024/",
      "score": 59,
      "selftext": "The r/CredibleDefense daily megathread is for asking questions and posting submissions that would not fit the criteria of our post submissions. As such, submissions are less stringently moderated, but we still do keep an elevated guideline for comments.\n\n  Comment guidelines:\n\n&#x200B;\n\nPlease do:\n\n&#x200B;\n\n\\* Be curious not judgmental,\n\n\\* Be polite and civil,\n\n\\* Use the original title of the work you are linking to,\n\n\\* Use capitalization,\n\n\\* Link to the article or source of information that you are referring to,\n\n\\* Make it clear what is your opinion and from what the source actually says. Please minimize editorializing, please make your opinions clearly distinct from the content of the article or source, please do *not* cherry pick facts to support a preferred narrative,\n\n\\* Read the articles before you comment, and comment on the content of the articles,\n\n\\* Post only credible information\n\n\\* Contribute to the forum by finding and submitting your own credible articles,\n\n&#x200B;\n\nPlease do not:\n\n&#x200B;\n\n\\* Use memes, emojis or swears excessively, \n\n\\* Use foul imagery,\n\n\\* Use acronyms like LOL, LMAO, WTF, /s, etc. excessively,\n\n\\* Start fights with other commenters,\n\n\\* Make it personal, \n\n\\* Try to out someone,\n\n\\* Try to push narratives, or fight for a cause in the comment section, or try to 'win the war,'\n\n\\* Engage in baseless speculation, fear mongering, or anxiety posting. Question asking is welcome and encouraged, but questions should focus on tangible issues and not groundless hypothetical scenarios. Before asking a question ask yourself 'How likely is this thing to occur.' Questions, like other kinds of comments, should be supported by evidence and must maintain the burden of credibility.\n\n&#x200B;\n\nPlease read our in depth rules [https://reddit.com/r/CredibleDefense/wiki/rules](https://reddit.com/r/CredibleDefense/wiki/rules). \n\n\n\nAlso please use the report feature if you want a comment to be reviewed faster. Don't abuse it though! If something is not obviously against the rules but you still feel that it should be reviewed, leave a short but descriptive comment while filing the report.",
      "spoiler": false,
      "stickied": false,
      "subreddit": "CredibleDefense",
      "title": "CredibleDefense Daily MegaThread July 27, 2024",
      "upvote_ratio": 0.94
    },
    "comments": [
      {
        "author": "u/Larelli",
        "body": "Some news regarding the structure of the Russian Armed Forces. Apparently, the 1st and the 2nd Army Corps (i.e. the former armies of the self-proclaimed Donetsk and Luhansk People's Republics, respectively) are likely to have been reformed into Combined Arms Armies. This is not officially confirmed yet either from the Russian MoD or from Ukrainian sources, but at this point I would say there is enough evidence to report this.\n\nTwo weeks ago, a lot of channels linked to the \"Akhmat\" galaxy as well as Kadyrov himself began mentioning the “3rd Combined Arms Army” (CAA) as part of the Southern Military District.\n\nhttps://t. me/RKadyrov_95/4944\n\nSpecifically, the first post is dated July 12 and mentions the 4th [Motorized] Brigade as part of the 3rd CAA. \n\nhttps://t. me/AptiAlaudinovAKHMAT/4909\n\nIt's well known that until now this brigade was part of the 2nd Corps. At first I thought it was a mistake, but subsequent publications have changed my mind. Even this channel (in spite of the not-yet-updated name), which until mid July was mentioning the 4th Brigade as part of the 2nd Corps, has started referring to this brigade as part of the 3rd Army: this cannot be a mistake.\n\nhttps://t. me/medsluzba_speznaz_akhmat/86\n\nBy the way, the 4th Motorized Brigade (a historical brigade of the LPR Army, based in Khrustalnyi in Luhansk Oblast), currently active in the southern flank of the Chasiv Yar sector, is often mentioned by Akhmat-related channels as it works closely with Akhmat units such as the 78th Motorized Regiment “Sever-Akhmat” and detachments of the “Akhmat Special Forces”. The commander of the “Akhmat Special Forces” (Major General Apti Alaudinov) was the deputy commander of the 2nd Corps until April. In general, Kadyrov's men have quite some influence in the 2nd Corps. \n\nThis channel, too, run by the commander of the “Shustrogo” Detachment of the “Akhmat Special Forces” as well as of the 2nd Battalion of the 4th Motorized Brigade, recently updated the bio, mentioning the 4th Brigade as part of the 3rd CAA.\n\nhttps://t. me/shustryii_i\n\nI investigated on VK and found a [photo](https://i.imgur.com/6nN3oNx.jpeg), published during this week, featuring an official recognition issued by the command of the 3rd CAA (*3 общевойсковая армия*), which also features the logo of the new army (which doesn't match the logo of any of the existing armies). Note the colors of the former LPR flag behind the logo. Interestingly, the new CAA does not appear to have inherited the “Guards” status from the 2nd Army Corps for the time being. In any case, this made me sure that the 2nd Corps during this month was indeed reformed into the 3rd Army. \n\nWhy 3rd? At first I thought because it was the first available number not occupied by existing CAAs, but this number is actually logical from a historical point of view. During the course of Operation \"Gallop\", on the morning of February 14, 1943, the vanguards of the divisions of the 18th Rifle Corps (as part of the 3rd Guards Army) penetrated the city of Luhansk (back then Voroshilovgrad), liberating it from the Germans.\n\nIncidentally, in mid June the Russian Telegram channel “Northern Channel”, run by servicemen of the Group of Forces “North”, had mentioned the transfer to the Kharkiv sector (from Donetsk Oblast) of elements of the 9th Motorized Brigade as part of... the 51st Army. \n\nhttps://t. me/severnnyi/1282\n\nAt the time I thought it was a mistake. Thinking back and linking this to the other news, at this point I find it very likely that 1st Corps too is being reformed as a CAA, specifically into the 51st Army.\n\nAgain, why 51st? During the course of the Second Donbas strategic offensive, on the morning of September 8, 1943, units of the 50th Guards Rifle Divisions of the 3rd Guards Rifle Corps (part of the 5th Shock Army), entered Donetsk (back then Stalino), liberating the city. The “issue” for the Russians is that there is already an army with this number - the 5th CAA of Eastern MD. However, the 3rd Guards Rifle Corps had been transferred to the 5th Shock Army only at the end of August: until then it was fighting as part... of the 51st Army, which in any case continued to support the offensive of the Southern Front in the Donbas. Consequently, naming it 51st Army makes historical sense.\n\nA few final considerations. Firstly, there is no evidence at the moment that this reform is accompanied by the creation of new maneuver brigades or by the reform of some of the existing brigades into divisions. Unless this is disproved, in the front this reform should not have major consequences.\n\nIn my opinion, this reform has a primarily and fundamentally organizational and administrative purpose. During the Donbas War of 10 years ago and in the following period, the armies of the two self-proclaimed republics were under the operational subordination of the 8th CAA of the Southern MD. When after the sham referendums these two oblasts joined Russia, the two armies became the 1st and 2nd Army Corps of the 8th CAA, as part of the Southern MD. The problem is that this resulted in a huge army, totally disproportionate to the average size of the other CAAs. Let's take into account that already until 2022 the 8th CAA was quite large compared to the average - fielding the 20th and 150th Motorized Divisions in addition to an artillery brigade, a rocket brigade and the other support units. The “median” Russian CAA is comparable in size to a NATO division, just a little bigger; the larger ones (1st GTA, 58th CAA) could be comparable to a NATO corps, but then there is the 29th CAA consisting of only one (!) maneuver brigade (+ the support units). \n\nWith the 1st and 2nd Corps joining it, the 8th CAA had become extremely larger than the other CAAs; the only one among these formations to reach the size of an actual field army. Let's recall that the 1st and 2nd Corps are very large, in fact their nominal complement and equipment would make them stronger and bigger than most CAAs. Both the corps field six motorized brigades (1st Corps: 1st, 5th, 9th, 110th, 114th, 132nd; 2nd Corps: 4th, 6th, 7th, 85th, 88th, 123rd) + the rifle regiments of the mobilization reserve (a dozen for the 1st Corps, several for the 2nd) + several separate battalions (including maneuver ones) + an artillery brigade (1st Corps: 14th; 2nd Corps: 2nd) + the other support units. This is extremely more than the typical Russian corps, which consists of either one maneuver division and one maneuver brigade or two maneuver brigades, plus some minor support units (most of the corps for instance do not have an artillery brigade). \n\nWith such a reform, the former 1st and 2nd Corps will probably receive an improvement in terms of support units that they don't have now (such as a rocket brigade, an anti-aircraft rocket brigade, a control brigade, an engineer-sapper regiment, a CBRN regiment etc), since at the moment the support units are absolutely undersized in relation to their maneuver units, compared to the median Russian CAA. In addition, I imagine they are going to increase and strengthen their HQ Staff. Who knows if on the Russian side this is a way to further dilute the power of the “old guard” officers from the Donbas. Let's recall, however, that the 1st and 2nd Corps have been largely made up of soldiers from Russia proper for a while, after the huge losses of their servicemen who were veterans of the Donbas War and of those mobilized from these two republics during 2022. \n\nIn all of this, the status of the 3rd Army Corps (the one formed by volunteers during the summer of 2022 to reinforce the meager Russian forces at the front, and which was brought to strength in the following fall thanks to the influx of mobilized men), is unclear. It was never even really clear to which military district it belongs. Officially it was formed in Nizhny Novgorod Oblast and was said to be part of the then Western MD (some Russian sources gave it subordinate to the 20th CAA), later for a Russian source it may have joined the Southern MD; however its 72nd Motorized Brigade was formed in Orenburg Oblast, and for the Ukrainian observer Mashovets this brigade is based in Omsk (both these oblasts fall under the Central MD). At the moment its units are fighting under the GoF “South”: the 72nd Brigade together with most of the 6th Motorized Division (made up of the recently formed 54th Motorized Regiment and several regiments of the Territorial Forces) are fighting in the southern flank of the Chasiv Yar sector, while the 57th Motorized Regiment of the 6th Motorized Division is fighting together with the 20th Motorized Division of the 8th CAA in the Kurakhove sector (again under the jurisdiction of the GoF “South”). There is currently no evidence that this corps has joined one of these two new CAAs mentioned above.",
        "body_html": "<div class=\"md\"><p>Some news regarding the structure of the Russian Armed Forces. Apparently, the 1st and the 2nd Army Corps (i.e. the former armies of the self-proclaimed Donetsk and Luhansk People&#39;s Republics, respectively) are likely to have been reformed into Combined Arms Armies. This is not officially confirmed yet either from the Russian MoD or from Ukrainian sources, but at this point I would say there is enough evidence to report this.</p>\n\n<p>Two weeks ago, a lot of channels linked to the &quot;Akhmat&quot; galaxy as well as Kadyrov himself began mentioning the “3rd Combined Arms Army” (CAA) as part of the Southern Military District.</p>\n\n<p><a href=\"https://t\">https://t</a>. me/RKadyrov_95/4944</p>\n\n<p>Specifically, the first post is dated July 12 and mentions the 4th [Motorized] Brigade as part of the 3rd CAA. </p>\n\n<p><a href=\"https://t\">https://t</a>. me/AptiAlaudinovAKHMAT/4909</p>\n\n<p>It&#39;s well known that until now this brigade was part of the 2nd Corps. At first I thought it was a mistake, but subsequent publications have changed my mind. Even this channel (in spite of the not-yet-updated name), which until mid July was mentioning the 4th Brigade as part of the 2nd Corps, has started referring to this brigade as part of the 3rd Army: this cannot be a mistake.</p>\n\n<p><a href=\"https://t\">https://t</a>. me/medsluzba_speznaz_akhmat/86</p>\n\n<p>By the way, the 4th Motorized Brigade (a historical brigade of the LPR Army, based in Khrustalnyi in Luhansk Oblast), currently active in the southern flank of the Chasiv Yar sector, is often mentioned by Akhmat-related channels as it works closely with Akhmat units such as the 78th Motorized Regiment “Sever-Akhmat” and detachments of the “Akhmat Special Forces”. The commander of the “Akhmat Special Forces” (Major General Apti Alaudinov) was the deputy commander of the 2nd Corps until April. In general, Kadyrov&#39;s men have quite some influence in the 2nd Corps. </p>\n\n<p>This channel, too, run by the commander of the “Shustrogo” Detachment of the “Akhmat Special Forces” as well as of the 2nd Battalion of the 4th Motorized Brigade, recently updated the bio, mentioning the 4th Brigade as part of the 3rd CAA.</p>\n\n<p><a href=\"https://t\">https://t</a>. me/shustryii_i</p>\n\n<p>I investigated on VK and found a <a href=\"https://i.imgur.com/6nN3oNx.jpeg\">photo</a>, published during this week, featuring an official recognition issued by the command of the 3rd CAA (<em>3 общевойсковая армия</em>), which also features the logo of the new army (which doesn&#39;t match the logo of any of the existing armies). Note the colors of the former LPR flag behind the logo. Interestingly, the new CAA does not appear to have inherited the “Guards” status from the 2nd Army Corps for the time being. In any case, this made me sure that the 2nd Corps during this month was indeed reformed into the 3rd Army. </p>\n\n<p>Why 3rd? At first I thought because it was the first available number not occupied by existing CAAs, but this number is actually logical from a historical point of view. During the course of Operation &quot;Gallop&quot;, on the morning of February 14, 1943, the vanguards of the divisions of the 18th Rifle Corps (as part of the 3rd Guards Army) penetrated the city of Luhansk (back then Voroshilovgrad), liberating it from the Germans.</p>\n\n<p>Incidentally, in mid June the Russian Telegram channel “Northern Channel”, run by servicemen of the Group of Forces “North”, had mentioned the transfer to the Kharkiv sector (from Donetsk Oblast) of elements of the 9th Motorized Brigade as part of... the 51st Army. </p>\n\n<p><a href=\"https://t\">https://t</a>. me/severnnyi/1282</p>\n\n<p>At the time I thought it was a mistake. Thinking back and linking this to the other news, at this point I find it very likely that 1st Corps too is being reformed as a CAA, specifically into the 51st Army.</p>\n\n<p>Again, why 51st? During the course of the Second Donbas strategic offensive, on the morning of September 8, 1943, units of the 50th Guards Rifle Divisions of the 3rd Guards Rifle Corps (part of the 5th Shock Army), entered Donetsk (back then Stalino), liberating the city. The “issue” for the Russians is that there is already an army with this number - the 5th CAA of Eastern MD. However, the 3rd Guards Rifle Corps had been transferred to the 5th Shock Army only at the end of August: until then it was fighting as part... of the 51st Army, which in any case continued to support the offensive of the Southern Front in the Donbas. Consequently, naming it 51st Army makes historical sense.</p>\n\n<p>A few final considerations. Firstly, there is no evidence at the moment that this reform is accompanied by the creation of new maneuver brigades or by the reform of some of the existing brigades into divisions. Unless this is disproved, in the front this reform should not have major consequences.</p>\n\n<p>In my opinion, this reform has a primarily and fundamentally organizational and administrative purpose. During the Donbas War of 10 years ago and in the following period, the armies of the two self-proclaimed republics were under the operational subordination of the 8th CAA of the Southern MD. When after the sham referendums these two oblasts joined Russia, the two armies became the 1st and 2nd Army Corps of the 8th CAA, as part of the Southern MD. The problem is that this resulted in a huge army, totally disproportionate to the average size of the other CAAs. Let&#39;s take into account that already until 2022 the 8th CAA was quite large compared to the average - fielding the 20th and 150th Motorized Divisions in addition to an artillery brigade, a rocket brigade and the other support units. The “median” Russian CAA is comparable in size to a NATO division, just a little bigger; the larger ones (1st GTA, 58th CAA) could be comparable to a NATO corps, but then there is the 29th CAA consisting of only one (!) maneuver brigade (+ the support units). </p>\n\n<p>With the 1st and 2nd Corps joining it, the 8th CAA had become extremely larger than the other CAAs; the only one among these formations to reach the size of an actual field army. Let&#39;s recall that the 1st and 2nd Corps are very large, in fact their nominal complement and equipment would make them stronger and bigger than most CAAs. Both the corps field six motorized brigades (1st Corps: 1st, 5th, 9th, 110th, 114th, 132nd; 2nd Corps: 4th, 6th, 7th, 85th, 88th, 123rd) + the rifle regiments of the mobilization reserve (a dozen for the 1st Corps, several for the 2nd) + several separate battalions (including maneuver ones) + an artillery brigade (1st Corps: 14th; 2nd Corps: 2nd) + the other support units. This is extremely more than the typical Russian corps, which consists of either one maneuver division and one maneuver brigade or two maneuver brigades, plus some minor support units (most of the corps for instance do not have an artillery brigade). </p>\n\n<p>With such a reform, the former 1st and 2nd Corps will probably receive an improvement in terms of support units that they don&#39;t have now (such as a rocket brigade, an anti-aircraft rocket brigade, a control brigade, an engineer-sapper regiment, a CBRN regiment etc), since at the moment the support units are absolutely undersized in relation to their maneuver units, compared to the median Russian CAA. In addition, I imagine they are going to increase and strengthen their HQ Staff. Who knows if on the Russian side this is a way to further dilute the power of the “old guard” officers from the Donbas. Let&#39;s recall, however, that the 1st and 2nd Corps have been largely made up of soldiers from Russia proper for a while, after the huge losses of their servicemen who were veterans of the Donbas War and of those mobilized from these two republics during 2022. </p>\n\n<p>In all of this, the status of the 3rd Army Corps (the one formed by volunteers during the summer of 2022 to reinforce the meager Russian forces at the front, and which was brought to strength in the following fall thanks to the influx of mobilized men), is unclear. It was never even really clear to which military district it belongs. Officially it was formed in Nizhny Novgorod Oblast and was said to be part of the then Western MD (some Russian sources gave it subordinate to the 20th CAA), later for a Russian source it may have joined the Southern MD; however its 72nd Motorized Brigade was formed in Orenburg Oblast, and for the Ukrainian observer Mashovets this brigade is based in Omsk (both these oblasts fall under the Central MD). At the moment its units are fighting under the GoF “South”: the 72nd Brigade together with most of the 6th Motorized Division (made up of the recently formed 54th Motorized Regiment and several regiments of the Territorial Forces) are fighting in the southern flank of the Chasiv Yar sector, while the 57th Motorized Regiment of the 6th Motorized Division is fighting together with the 20th Motorized Division of the 8th CAA in the Kurakhove sector (again under the jurisdiction of the GoF “South”). There is currently no evidence that this corps has joined one of these two new CAAs mentioned above.</p>\n</div>",
        "created_utc": "2024-07-27 09:44:57",
        "distinguished": null,
        "edited": false,
        "id": "lf7lawh",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 80,
        "stickied": false,
        "replies": [
          {
            "author": "u/checco_2020",
            "body": "Why are Russian CAA so small?  \nIs it a way to boost morale, in some ways, or is there more funcionality to it?",
            "body_html": "<div class=\"md\"><p>Why are Russian CAA so small?<br/>\nIs it a way to boost morale, in some ways, or is there more funcionality to it?</p>\n</div>",
            "created_utc": "2024-07-28 04:28:54",
            "distinguished": null,
            "edited": false,
            "id": "lfbmika",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf7lawh",
            "score": 2,
            "stickied": false,
            "replies": [
              {
                "author": "u/Larelli",
                "body": "Long story short: it's a legacy of WW2, when a Soviet corps (which has a troubled history as a formation in the Red Army) was comparable to an Axis division in terms of manpower and equipment, and a Soviet army was comparable to an Axis corps. Soviet armies, of which there were countless, had only a fraction of the men of the Axis armies at peak strength.",
                "body_html": "<div class=\"md\"><p>Long story short: it&#39;s a legacy of WW2, when a Soviet corps (which has a troubled history as a formation in the Red Army) was comparable to an Axis division in terms of manpower and equipment, and a Soviet army was comparable to an Axis corps. Soviet armies, of which there were countless, had only a fraction of the men of the Axis armies at peak strength.</p>\n</div>",
                "created_utc": "2024-07-28 16:59:08",
                "distinguished": null,
                "edited": false,
                "id": "lfewukg",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lfbmika",
                "score": 3,
                "stickied": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "u/Culinaromancer",
        "body": "Seems like a bunch of \"Wagner\" and Malian army soldiers got killed and captured by the Tuareg militia in Tinzaouaten at the Mali-Algeria border. Not sure what the actual military situation there is but seems a pretty big loss of life for this kind of conflict. As I understand the Wagner/Mali army were conducting some sort of offensive to push the Tuaregs out of there\n\nhttps://x.com/Maks_NAFO_FELLA/status/1817282576395997628",
        "body_html": "<div class=\"md\"><p>Seems like a bunch of &quot;Wagner&quot; and Malian army soldiers got killed and captured by the Tuareg militia in Tinzaouaten at the Mali-Algeria border. Not sure what the actual military situation there is but seems a pretty big loss of life for this kind of conflict. As I understand the Wagner/Mali army were conducting some sort of offensive to push the Tuaregs out of there</p>\n\n<p><a href=\"https://x.com/Maks_NAFO_FELLA/status/1817282576395997628\">https://x.com/Maks_NAFO_FELLA/status/1817282576395997628</a></p>\n</div>",
        "created_utc": "2024-07-27 13:41:50",
        "distinguished": null,
        "edited": false,
        "id": "lf8og6k",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 92,
        "stickied": false,
        "replies": [
          {
            "author": "u/RedditorsAreAssss",
            "body": "The CSP have been stalking that Wagner convoy for a few days now and [amusingly, livestreaming it with Starlink](https://x.com/SimNasr/status/1816519993334595958). The thread covers from the initial CSP stalking of the convoy through to aftermath photos. Of particular interest is the use of what appear to be FPV drones, the innovations in Ukraine are proliferating. \n\n[Here's an image of the helicopter after it was damaged and had a \"hard landing](https://x.com/SimNasr/status/1816922820963975396). \n\n[JNIM is also claiming credit for an ambush against the same convoy](https://x.com/SaladinAlDronni/status/1817319839410663663) alleging 50 Wagner KIA and 10 FAMA KIA. [These casualty figures track with OSINT analysis](https://x.com/vcdgf555/status/1817310443758895462). There's a bit of an argument [between CSP and JNIM](https://x.com/SimNasr/status/1817332580343222771) over who did what. \n\nIt looks like the timeline may be \n\n* CSP stalks convoy\n* Initial CSP ambush produces relatively light casualties but brings down the helicopter escort\n* Convoy turns around abandoning a significant number of vehicles in the process\n* JNIM ambushes the retreating column, routing them and inflicting significant losses\n\nAll in all a complete disaster for Wagner/FAMA, this has been quite a bloody week and we're still waiting on IS to claim credit for what appear to have been even bigger battles in Niger. Rumors of up to 230 Nigerien KIA in a single instance but no evidence yet.",
            "body_html": "<div class=\"md\"><p>The CSP have been stalking that Wagner convoy for a few days now and <a href=\"https://x.com/SimNasr/status/1816519993334595958\">amusingly, livestreaming it with Starlink</a>. The thread covers from the initial CSP stalking of the convoy through to aftermath photos. Of particular interest is the use of what appear to be FPV drones, the innovations in Ukraine are proliferating. </p>\n\n<p><a href=\"https://x.com/SimNasr/status/1816922820963975396\">Here&#39;s an image of the helicopter after it was damaged and had a &quot;hard landing</a>. </p>\n\n<p><a href=\"https://x.com/SaladinAlDronni/status/1817319839410663663\">JNIM is also claiming credit for an ambush against the same convoy</a> alleging 50 Wagner KIA and 10 FAMA KIA. <a href=\"https://x.com/vcdgf555/status/1817310443758895462\">These casualty figures track with OSINT analysis</a>. There&#39;s a bit of an argument <a href=\"https://x.com/SimNasr/status/1817332580343222771\">between CSP and JNIM</a> over who did what. </p>\n\n<p>It looks like the timeline may be </p>\n\n<ul>\n<li>CSP stalks convoy</li>\n<li>Initial CSP ambush produces relatively light casualties but brings down the helicopter escort</li>\n<li>Convoy turns around abandoning a significant number of vehicles in the process</li>\n<li>JNIM ambushes the retreating column, routing them and inflicting significant losses</li>\n</ul>\n\n<p>All in all a complete disaster for Wagner/FAMA, this has been quite a bloody week and we&#39;re still waiting on IS to claim credit for what appear to have been even bigger battles in Niger. Rumors of up to 230 Nigerien KIA in a single instance but no evidence yet.</p>\n</div>",
            "created_utc": "2024-07-27 16:32:40",
            "distinguished": null,
            "edited": "2024-07-27 16:39:16",
            "id": "lf9ekok",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8og6k",
            "score": 48,
            "stickied": false,
            "replies": [
              {
                "author": "u/Repulsive_bugmeat",
                "body": "Drone have been used in the region in 2018 against the French force and Fama",
                "body_html": "<div class=\"md\"><p>Drone have been used in the region in 2018 against the French force and Fama</p>\n</div>",
                "created_utc": "2024-07-28 06:15:12",
                "distinguished": null,
                "edited": false,
                "id": "lfbyyp6",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf9ekok",
                "score": 1,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/OpenOb",
            "body": "There are also reports that the admin of the Wagner channel \"Grey Zone\" was killed:\n\n>Wagner Telegram “Grey Zone” channel admin was likely killed in this attack. Last message on 23 July.\n\n[https://x.com/wartranslated/status/1817313553407259117](https://x.com/wartranslated/status/1817313553407259117)\n\nThere is an obituary: [https://x.com/sageblackmonk/status/1817316836054126851](https://x.com/sageblackmonk/status/1817316836054126851)\n\nMore reports: [https://x.com/RALee85/status/1817327222190932243](https://x.com/RALee85/status/1817327222190932243)",
            "body_html": "<div class=\"md\"><p>There are also reports that the admin of the Wagner channel &quot;Grey Zone&quot; was killed:</p>\n\n<blockquote>\n<p>Wagner Telegram “Grey Zone” channel admin was likely killed in this attack. Last message on 23 July.</p>\n</blockquote>\n\n<p><a href=\"https://x.com/wartranslated/status/1817313553407259117\">https://x.com/wartranslated/status/1817313553407259117</a></p>\n\n<p>There is an obituary: <a href=\"https://x.com/sageblackmonk/status/1817316836054126851\">https://x.com/sageblackmonk/status/1817316836054126851</a></p>\n\n<p>More reports: <a href=\"https://x.com/RALee85/status/1817327222190932243\">https://x.com/RALee85/status/1817327222190932243</a></p>\n</div>",
            "created_utc": "2024-07-27 15:31:05",
            "distinguished": null,
            "edited": "2024-07-27 15:39:27",
            "id": "lf95g9d",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8og6k",
            "score": 57,
            "stickied": false,
            "replies": [
              {
                "author": "u/RedditorsAreAssss",
                "body": "[Possibly a photo of his corpse](https://x.com/Jack_Mrgln/status/1817330338085089528) for further confirmation. The image is quite tame in case readers are worried.",
                "body_html": "<div class=\"md\"><p><a href=\"https://x.com/Jack_Mrgln/status/1817330338085089528\">Possibly a photo of his corpse</a> for further confirmation. The image is quite tame in case readers are worried.</p>\n</div>",
                "created_utc": "2024-07-27 16:21:21",
                "distinguished": null,
                "edited": false,
                "id": "lf9cwog",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf95g9d",
                "score": 33,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Jr7711",
                    "body": "Fascist patch in the 3rd photo too. Classy.",
                    "body_html": "<div class=\"md\"><p>Fascist patch in the 3rd photo too. Classy.</p>\n</div>",
                    "created_utc": "2024-07-27 19:11:53",
                    "distinguished": null,
                    "edited": false,
                    "id": "lfa1e2o",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf9cwog",
                    "score": 24,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/svenne",
            "body": "Reminds me of a story my neighbour told me. In Sweden. His daughter was taking a PhD and was visiting Mongolia first, then later Mali. This was maybe 8 years ago. \n\nShe arrived without any real plans. She went to a hotel where she was going to stay, and already in the lobby there was someone in Tuareg tribal clothing. She managed to hitch a ride basically with him to his family, and stayed with them in the desert. Turns out he was a tribal leader and many people came visiting his tent camp to pay respects and discuss things. \n\nMy neighbor was worried because there had been news recently in those times about terrorists in the deserts in North Africa, Mali, Libya etc. He managed to get a call with his daughter via satellite phone, and he also talked a bit with the tribal leader. \nMy neighbor asked the tribal leader if they were safe, saying he heard about dangerous terrorists in the area. The tribal leader replied \"but sir, we are the terrorists!\"",
            "body_html": "<div class=\"md\"><p>Reminds me of a story my neighbour told me. In Sweden. His daughter was taking a PhD and was visiting Mongolia first, then later Mali. This was maybe 8 years ago. </p>\n\n<p>She arrived without any real plans. She went to a hotel where she was going to stay, and already in the lobby there was someone in Tuareg tribal clothing. She managed to hitch a ride basically with him to his family, and stayed with them in the desert. Turns out he was a tribal leader and many people came visiting his tent camp to pay respects and discuss things. </p>\n\n<p>My neighbor was worried because there had been news recently in those times about terrorists in the deserts in North Africa, Mali, Libya etc. He managed to get a call with his daughter via satellite phone, and he also talked a bit with the tribal leader. \nMy neighbor asked the tribal leader if they were safe, saying he heard about dangerous terrorists in the area. The tribal leader replied &quot;but sir, we are the terrorists!&quot;</p>\n</div>",
            "created_utc": "2024-07-27 16:21:21",
            "distinguished": null,
            "edited": "2024-07-27 16:27:59",
            "id": "lf9cwos",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8og6k",
            "score": 52,
            "stickied": false,
            "replies": [
              {
                "author": "u/hell_jumper9",
                "body": "Are they the actual IS there in that region or just allied with them for convenience?",
                "body_html": "<div class=\"md\"><p>Are they the actual IS there in that region or just allied with them for convenience?</p>\n</div>",
                "created_utc": "2024-07-27 18:12:18",
                "distinguished": null,
                "edited": false,
                "id": "lf9t4ef",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf9cwos",
                "score": 9,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/RedditorsAreAssss",
                    "body": "The Tuareg separatists are not allied with JNIM or ISSP, the main commonality is that all three are enemies of the Malian and Nigerien governments.",
                    "body_html": "<div class=\"md\"><p>The Tuareg separatists are not allied with JNIM or ISSP, the main commonality is that all three are enemies of the Malian and Nigerien governments.</p>\n</div>",
                    "created_utc": "2024-07-27 20:38:01",
                    "distinguished": null,
                    "edited": false,
                    "id": "lfact1r",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf9t4ef",
                    "score": 19,
                    "stickied": false,
                    "replies": []
                  }
                ]
              },
              {
                "author": "u/Dangerous_Golf_7417",
                "body": "Didn't want to spam the active thread, but now that this one's been sent down I just wanted to let you know that this is probably the funniest post I've seen in /cd. Straight from a movie. ",
                "body_html": "<div class=\"md\"><p>Didn&#39;t want to spam the active thread, but now that this one&#39;s been sent down I just wanted to let you know that this is probably the funniest post I&#39;ve seen in /cd. Straight from a movie. </p>\n</div>",
                "created_utc": "2024-07-28 09:39:31",
                "distinguished": null,
                "edited": false,
                "id": "lfcw1t2",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf9cwos",
                "score": 8,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/svenne",
                    "body": "Yea my neighbour was also a very peculiar guy. He made Russian borscht for us while telling the story. And he has all sort of souvenirs in his home, Masai spears etc. And there was a story of how he tricked security once getting past them, so he could listen to a closed doors speech by French President Hollande for an art-hall opening in a French village. But glad you enjoyed reading.",
                    "body_html": "<div class=\"md\"><p>Yea my neighbour was also a very peculiar guy. He made Russian borscht for us while telling the story. And he has all sort of souvenirs in his home, Masai spears etc. And there was a story of how he tricked security once getting past them, so he could listen to a closed doors speech by French President Hollande for an art-hall opening in a French village. But glad you enjoyed reading.</p>\n</div>",
                    "created_utc": "2024-07-28 09:57:49",
                    "distinguished": null,
                    "edited": "2024-07-29 05:14:51",
                    "id": "lfcza2l",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lfcw1t2",
                    "score": 6,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/Tricky-Astronaut",
            "body": "More information about the situation in Mali:\n\n\nhttps://www.reuters.com/world/africa/mali-rebels-say-they-killed-injured-dozens-soldiers-wagner-mercenaries-fighting-2024-07-27/",
            "body_html": "<div class=\"md\"><p>More information about the situation in Mali:</p>\n\n<p><a href=\"https://www.reuters.com/world/africa/mali-rebels-say-they-killed-injured-dozens-soldiers-wagner-mercenaries-fighting-2024-07-27/\">https://www.reuters.com/world/africa/mali-rebels-say-they-killed-injured-dozens-soldiers-wagner-mercenaries-fighting-2024-07-27/</a></p>\n</div>",
            "created_utc": "2024-07-27 14:05:00",
            "distinguished": null,
            "edited": false,
            "id": "lf8s7ez",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8og6k",
            "score": 18,
            "stickied": false,
            "replies": []
          }
        ]
      },
      {
        "author": "u/PermissionOne8683",
        "body": "# Summary: Hezbollah attacks against the Majdal Sham’s soccer field\n\nThe attack occurred against the Majdal Shams’ soccer/football field located at 33.26581446124356, 35.76876503445448 which is a town in the Golan Heights. An estimated 10-15 people were killed with over 30 more injured. Casualty wise, this is one of the more significant attacks launched by Hezbollah.\n\n**Initial strikes:**\n\nHere’s footage of the initial rockets hitting the field:  \n[https://www.reddit.com/r/CombatFootage/comments/1edkogu/hezbollah\\_rocket\\_attack\\_against\\_a\\_playground\\_and/](https://www.reddit.com/r/CombatFootage/comments/1edkogu/hezbollah_rocket_attack_against_a_playground_and/)\n\nSoccer players running out of the field, right after it was hit:  \n[https://twitter.com/HananyaNaftali/status/1817228506901643550/video/1](https://twitter.com/HananyaNaftali/status/1817228506901643550/video/1)\n\n**Aftermath footage:**\n\n1. [Image # 1, includes images of the victims (NFSW warning)](https://pbs.twimg.com/media/GTgy2cQW0AAQKkN?format=jpg&name=medium)\n2. [Image # 2, shows the strikes made against the field](https://pbs.twimg.com/media/GTgy2cVXoAAXVdq?format=jpg&name=900x900)\n3. [Image # 3, shows another angle of the fence damaged](https://pbs.twimg.com/media/GThTL2eWQAAmRvf?format=jpg&name=large)\n4. [Image # 4, another angle of the fence](https://pbs.twimg.com/media/GThTL2mXkAACD4i?format=jpg&name=large)\n5. [Image # 5, a nearby building was damaged with shrapnel ](https://pbs.twimg.com/media/GThTL2lWsAAqdMV?format=jpg&name=large)\n6. [Image # 6, a crowd gathered around bodies laying in the field](https://pbs.twimg.com/media/GTgzhDvWcAAmJ7a?format=jpg&name=900x900)\n7. [Video #1, families running towards the site](https://twitter.com/HenMazzig/status/1817236379098591519/video/2)\n\n**Weaponry and targeting:**\n\nThe soccer field is located approx. 8-10 km from the Lebanon border, adjusted for where a launch site might be. Here's an image showing the claimed trajectory of the rocket ([link](https://pbs.twimg.com/media/GThbmMZWYAAtJYS?format=jpg&name=900x900)). The current theory is that an Iranian manufactured [Falaq-1](https://en.wikipedia.org/wiki/Falaq-1) rocket was used. According to Wikipedia it is an *unguided* missile, and has a maximum range of 10 km. \n\n**Response:** (includes unconfirmed reporting from OSINTDefender):\n\nIsraeli Officials:\n\n“Israeli Prime Minister Benjamin Netanyahu has Instructed his Staff to get the Delegation together for their Immediate Return to Israel.”\n\n“Israeli Minister of National Security, Itamar Ben-Gvir calls for Prime Minister Netanyahu to convene the Cabinet now by Encrypted Phone, and to Declare a State of War against Hezbollah.”\n\n“Israeli Minister of Foreign Affairs, Israel Katz says following tonight’s Hezbollah Rocket Attack on a Children’s Soccer Match within the Town of Majdal Shams, “We are approaching the moment of an All-Out War in the North against Hezbollah.”\n\nU.S. Officials:\n\n\"A U.S. Defense Official has stated that the Rocket which Struck a Soccer Field in the Northern Israeli Town of Majdal Shams earlier today, was Undoubtedly Launched by Hezbollah; though it is still Unknown if the Soccer Field was the Intended Target of the Attack.\"\n\n**Sources:**\n\n1. [https://www.jpost.com/breaking-news/article-812106](https://www.jpost.com/breaking-news/article-812106)\n2. [https://www.cnn.com/2024/07/27/middleeast/lebanon-israel-golan-strikes-intl-latam/index.html](https://www.cnn.com/2024/07/27/middleeast/lebanon-israel-golan-strikes-intl-latam/index.html)\n3. [https://www.timesofisrael.com/liveblog-july-27-2024/](https://www.timesofisrael.com/liveblog-july-27-2024/)\n4. [https://www.foxnews.com/world/hezbollah-hits-israel-deadliest-attack-months-long-conflict-idf-says-raising-fears-escalation](https://www.foxnews.com/world/hezbollah-hits-israel-deadliest-attack-months-long-conflict-idf-says-raising-fears-escalation)",
        "body_html": "<div class=\"md\"><h1>Summary: Hezbollah attacks against the Majdal Sham’s soccer field</h1>\n\n<p>The attack occurred against the Majdal Shams’ soccer/football field located at 33.26581446124356, 35.76876503445448 which is a town in the Golan Heights. An estimated 10-15 people were killed with over 30 more injured. Casualty wise, this is one of the more significant attacks launched by Hezbollah.</p>\n\n<p><strong>Initial strikes:</strong></p>\n\n<p>Here’s footage of the initial rockets hitting the field:<br/>\n<a href=\"https://www.reddit.com/r/CombatFootage/comments/1edkogu/hezbollah_rocket_attack_against_a_playground_and/\">https://www.reddit.com/r/CombatFootage/comments/1edkogu/hezbollah_rocket_attack_against_a_playground_and/</a></p>\n\n<p>Soccer players running out of the field, right after it was hit:<br/>\n<a href=\"https://twitter.com/HananyaNaftali/status/1817228506901643550/video/1\">https://twitter.com/HananyaNaftali/status/1817228506901643550/video/1</a></p>\n\n<p><strong>Aftermath footage:</strong></p>\n\n<ol>\n<li><a href=\"https://pbs.twimg.com/media/GTgy2cQW0AAQKkN?format=jpg&amp;name=medium\">Image # 1, includes images of the victims (NFSW warning)</a></li>\n<li><a href=\"https://pbs.twimg.com/media/GTgy2cVXoAAXVdq?format=jpg&amp;name=900x900\">Image # 2, shows the strikes made against the field</a></li>\n<li><a href=\"https://pbs.twimg.com/media/GThTL2eWQAAmRvf?format=jpg&amp;name=large\">Image # 3, shows another angle of the fence damaged</a></li>\n<li><a href=\"https://pbs.twimg.com/media/GThTL2mXkAACD4i?format=jpg&amp;name=large\">Image # 4, another angle of the fence</a></li>\n<li><a href=\"https://pbs.twimg.com/media/GThTL2lWsAAqdMV?format=jpg&amp;name=large\">Image # 5, a nearby building was damaged with shrapnel </a></li>\n<li><a href=\"https://pbs.twimg.com/media/GTgzhDvWcAAmJ7a?format=jpg&amp;name=900x900\">Image # 6, a crowd gathered around bodies laying in the field</a></li>\n<li><a href=\"https://twitter.com/HenMazzig/status/1817236379098591519/video/2\">Video #1, families running towards the site</a></li>\n</ol>\n\n<p><strong>Weaponry and targeting:</strong></p>\n\n<p>The soccer field is located approx. 8-10 km from the Lebanon border, adjusted for where a launch site might be. Here&#39;s an image showing the claimed trajectory of the rocket (<a href=\"https://pbs.twimg.com/media/GThbmMZWYAAtJYS?format=jpg&amp;name=900x900\">link</a>). The current theory is that an Iranian manufactured <a href=\"https://en.wikipedia.org/wiki/Falaq-1\">Falaq-1</a> rocket was used. According to Wikipedia it is an <em>unguided</em> missile, and has a maximum range of 10 km. </p>\n\n<p><strong>Response:</strong> (includes unconfirmed reporting from OSINTDefender):</p>\n\n<p>Israeli Officials:</p>\n\n<p>“Israeli Prime Minister Benjamin Netanyahu has Instructed his Staff to get the Delegation together for their Immediate Return to Israel.”</p>\n\n<p>“Israeli Minister of National Security, Itamar Ben-Gvir calls for Prime Minister Netanyahu to convene the Cabinet now by Encrypted Phone, and to Declare a State of War against Hezbollah.”</p>\n\n<p>“Israeli Minister of Foreign Affairs, Israel Katz says following tonight’s Hezbollah Rocket Attack on a Children’s Soccer Match within the Town of Majdal Shams, “We are approaching the moment of an All-Out War in the North against Hezbollah.”</p>\n\n<p>U.S. Officials:</p>\n\n<p>&quot;A U.S. Defense Official has stated that the Rocket which Struck a Soccer Field in the Northern Israeli Town of Majdal Shams earlier today, was Undoubtedly Launched by Hezbollah; though it is still Unknown if the Soccer Field was the Intended Target of the Attack.&quot;</p>\n\n<p><strong>Sources:</strong></p>\n\n<ol>\n<li><a href=\"https://www.jpost.com/breaking-news/article-812106\">https://www.jpost.com/breaking-news/article-812106</a></li>\n<li><a href=\"https://www.cnn.com/2024/07/27/middleeast/lebanon-israel-golan-strikes-intl-latam/index.html\">https://www.cnn.com/2024/07/27/middleeast/lebanon-israel-golan-strikes-intl-latam/index.html</a></li>\n<li><a href=\"https://www.timesofisrael.com/liveblog-july-27-2024/\">https://www.timesofisrael.com/liveblog-july-27-2024/</a></li>\n<li><a href=\"https://www.foxnews.com/world/hezbollah-hits-israel-deadliest-attack-months-long-conflict-idf-says-raising-fears-escalation\">https://www.foxnews.com/world/hezbollah-hits-israel-deadliest-attack-months-long-conflict-idf-says-raising-fears-escalation</a></li>\n</ol>\n</div>",
        "created_utc": "2024-07-27 11:29:00",
        "distinguished": null,
        "edited": "2024-07-27 15:19:24",
        "id": "lf82vud",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 58,
        "stickied": false,
        "replies": [
          {
            "author": "u/-spartacus-",
            "body": "For anyone wondering about the pic with the NSFW how NSFW it is, it is quite gruesome.",
            "body_html": "<div class=\"md\"><p>For anyone wondering about the pic with the NSFW how NSFW it is, it is quite gruesome.</p>\n</div>",
            "created_utc": "2024-07-27 12:42:24",
            "distinguished": null,
            "edited": false,
            "id": "lf8ertz",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf82vud",
            "score": 36,
            "stickied": false,
            "replies": [
              {
                "author": "u/JumentousPetrichor",
                "body": "Seconding this",
                "body_html": "<div class=\"md\"><p>Seconding this</p>\n</div>",
                "created_utc": "2024-07-27 16:24:55",
                "distinguished": null,
                "edited": false,
                "id": "lf9dfw4",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8ertz",
                "score": 0,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/kdy420",
            "body": "Any idea why the Iron Dome didnt catch these ?\n\nPS: your 3rd link for the video is the same as the 2nd link for the picture",
            "body_html": "<div class=\"md\"><p>Any idea why the Iron Dome didnt catch these ?</p>\n\n<p>PS: your 3rd link for the video is the same as the 2nd link for the picture</p>\n</div>",
            "created_utc": "2024-07-27 13:01:45",
            "distinguished": null,
            "edited": false,
            "id": "lf8hw0f",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf82vud",
            "score": 8,
            "stickied": false,
            "replies": [
              {
                "author": "u/carkidd3242",
                "body": "Iron dome is focused on simple mortar and small rocket attacks (think a 80mm mortar or Grad rocket type thing), but even slower since many are home made. The Falaq-1 is a 240mm rocket that's much faster. There's also the question if coverage was there.",
                "body_html": "<div class=\"md\"><p>Iron dome is focused on simple mortar and small rocket attacks (think a 80mm mortar or Grad rocket type thing), but even slower since many are home made. The Falaq-1 is a 240mm rocket that&#39;s much faster. There&#39;s also the question if coverage was there.</p>\n</div>",
                "created_utc": "2024-07-27 14:46:52",
                "distinguished": null,
                "edited": false,
                "id": "lf8ys1b",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8hw0f",
                "score": 14,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/poincares_cook",
                "body": "It doesn't have a 100% interception rate. It's also unclear whether the area was covered by a system there are so many of them, and they are used both in the north and still on the Gaza border.",
                "body_html": "<div class=\"md\"><p>It doesn&#39;t have a 100% interception rate. It&#39;s also unclear whether the area was covered by a system there are so many of them, and they are used both in the north and still on the Gaza border.</p>\n</div>",
                "created_utc": "2024-07-27 14:19:36",
                "distinguished": null,
                "edited": false,
                "id": "lf8ui5u",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8hw0f",
                "score": 11,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/eric2332",
                "body": "Iron Dome isn't perfect. [A couple weeks ago, two Israeli civilians were killed not far from there by a Hezbollah rocket](https://www.timesofisrael.com/two-civilians-killed-in-hezbollah-rocket-attack-on-golan-heights/). This time they were \"luckier\" and it was 12 rather than 2.",
                "body_html": "<div class=\"md\"><p>Iron Dome isn&#39;t perfect. <a href=\"https://www.timesofisrael.com/two-civilians-killed-in-hezbollah-rocket-attack-on-golan-heights/\">A couple weeks ago, two Israeli civilians were killed not far from there by a Hezbollah rocket</a>. This time they were &quot;luckier&quot; and it was 12 rather than 2.</p>\n</div>",
                "created_utc": "2024-07-27 22:26:06",
                "distinguished": null,
                "edited": false,
                "id": "lfapltn",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8hw0f",
                "score": 9,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/Tiptoeinmyjordans",
                "body": "It was a rocket from my understanding.\n\nThere aren't too many systems deployed by any military that are built to intercept these. It's just not high on the priority list, for good reason. Although, the US is starting to take this serious and investing in short range air defence and in general finding many different systems to work together for that purpose.",
                "body_html": "<div class=\"md\"><p>It was a rocket from my understanding.</p>\n\n<p>There aren&#39;t too many systems deployed by any military that are built to intercept these. It&#39;s just not high on the priority list, for good reason. Although, the US is starting to take this serious and investing in short range air defence and in general finding many different systems to work together for that purpose.</p>\n</div>",
                "created_utc": "2024-07-27 13:34:36",
                "distinguished": null,
                "edited": false,
                "id": "lf8n9fu",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8hw0f",
                "score": 3,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/shrekabout",
                    "body": "What are you going on about... Lmao",
                    "body_html": "<div class=\"md\"><p>What are you going on about... Lmao</p>\n</div>",
                    "created_utc": "2024-07-27 14:18:41",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf8ud0g",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8n9fu",
                    "score": 0,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/obsessed_doomer",
            "body": "It's obvious why Hezbollah didn't take credit.  An attack on a soccer field while a bunch of people are playing is unambiguously horrific and senseless act.\n\nIf it was a soccer field elsewhere in Israel, they'd take credit because they'd use the '\"\"\"zionists\"\"\" aren't people' excuse that's popular nowadays, but that doesn't even work here, since the civilians killed aren't \"\"\"zionists\"\"\".",
            "body_html": "<div class=\"md\"><p>It&#39;s obvious why Hezbollah didn&#39;t take credit.  An attack on a soccer field while a bunch of people are playing is unambiguously horrific and senseless act.</p>\n\n<p>If it was a soccer field elsewhere in Israel, they&#39;d take credit because they&#39;d use the &#39;&quot;&quot;&quot;zionists&quot;&quot;&quot; aren&#39;t people&#39; excuse that&#39;s popular nowadays, but that doesn&#39;t even work here, since the civilians killed aren&#39;t &quot;&quot;&quot;zionists&quot;&quot;&quot;.</p>\n</div>",
            "created_utc": "2024-07-28 02:31:05",
            "distinguished": null,
            "edited": false,
            "id": "lfbbvol",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf82vud",
            "score": 8,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/Rhauko",
            "body": "Hezbollah claims to be not behind the attack, it might as well be Hamas or any of the other militant groups in south Lebanon\n\nEdit found an English source https://www.cbc.ca/news/world/israel-hezbollah-strike-soccer-field-golan-heights-1.7277711\n\nEdit: see reply by u/OpenOb the evidence points in their direction.",
            "body_html": "<div class=\"md\"><p>Hezbollah claims to be not behind the attack, it might as well be Hamas or any of the other militant groups in south Lebanon</p>\n\n<p>Edit found an English source <a href=\"https://www.cbc.ca/news/world/israel-hezbollah-strike-soccer-field-golan-heights-1.7277711\">https://www.cbc.ca/news/world/israel-hezbollah-strike-soccer-field-golan-heights-1.7277711</a></p>\n\n<p>Edit: see reply by <a href=\"/u/OpenOb\">u/OpenOb</a> the evidence points in their direction.</p>\n</div>",
            "created_utc": "2024-07-27 13:41:22",
            "distinguished": null,
            "edited": "2024-07-27 22:00:27",
            "id": "lf8odev",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf82vud",
            "score": 8,
            "stickied": false,
            "replies": [
              {
                "author": "u/junkie_jew",
                "body": "They're probably denying it because it killed Druze instead of Jews. Druze make up 5% of Lebanon's entire population. The optics of Hezbollah killing a bunch of Druze children playing soccer is horrible and would cost them significant support, so of course they'll deny responsibility. \n\nThere were over 100 rockets launched today. Do you really think that Hamas in Lebanon, or any other group in Lebanon is capable of that? If so, why did they wait 9 months to commit such a massive attack? This is exactly what Hezbollah has been doing since October 8th, only this time they succeeded in killing a significant amount of civilians, just not the ones they wanted to kill. Please, don't believe terrorists.",
                "body_html": "<div class=\"md\"><p>They&#39;re probably denying it because it killed Druze instead of Jews. Druze make up 5% of Lebanon&#39;s entire population. The optics of Hezbollah killing a bunch of Druze children playing soccer is horrible and would cost them significant support, so of course they&#39;ll deny responsibility. </p>\n\n<p>There were over 100 rockets launched today. Do you really think that Hamas in Lebanon, or any other group in Lebanon is capable of that? If so, why did they wait 9 months to commit such a massive attack? This is exactly what Hezbollah has been doing since October 8th, only this time they succeeded in killing a significant amount of civilians, just not the ones they wanted to kill. Please, don&#39;t believe terrorists.</p>\n</div>",
                "created_utc": "2024-07-27 14:43:34",
                "distinguished": null,
                "edited": false,
                "id": "lf8y9h3",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8odev",
                "score": 67,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Rhauko",
                    "body": "I don’t believe anything besides that Hezbollah claims they didn’t do it. I am not in the position to know who did it. Both Israel and Hezbollah have reasons to claim what they claim beyond the truth.  This sub is for objective discussion and information sharing. An Hezbollah claim they didn’t do it should be part of that.\n\nEdit: the evidence points towards them though.",
                    "body_html": "<div class=\"md\"><p>I don’t believe anything besides that Hezbollah claims they didn’t do it. I am not in the position to know who did it. Both Israel and Hezbollah have reasons to claim what they claim beyond the truth.  This sub is for objective discussion and information sharing. An Hezbollah claim they didn’t do it should be part of that.</p>\n\n<p>Edit: the evidence points towards them though.</p>\n</div>",
                    "created_utc": "2024-07-27 21:52:05",
                    "distinguished": null,
                    "edited": "2024-07-27 21:58:15",
                    "id": "lfalsj2",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8y9h3",
                    "score": -2,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/junkie_jew",
                        "body": "Fair enough. I misinterpreted your comment. Sorry about that",
                        "body_html": "<div class=\"md\"><p>Fair enough. I misinterpreted your comment. Sorry about that</p>\n</div>",
                        "created_utc": "2024-07-28 02:39:44",
                        "distinguished": null,
                        "edited": false,
                        "id": "lfbcldz",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lfalsj2",
                        "score": 6,
                        "stickied": false,
                        "replies": [
                          {
                            "author": "u/Rhauko",
                            "body": "No problem",
                            "body_html": "<div class=\"md\"><p>No problem</p>\n</div>",
                            "created_utc": "2024-07-28 05:04:17",
                            "distinguished": null,
                            "edited": false,
                            "id": "lfbq9o5",
                            "is_submitter": false,
                            "link_id": "t3_1edeq4c",
                            "parent_id": "t1_lfbcldz",
                            "score": 3,
                            "stickied": false,
                            "replies": []
                          }
                        ]
                      },
                      {
                        "author": "u/Phallindrome",
                        "body": "IDF and Hamas/Hezbollah aren't on the same level of credibility by a long shot, though. You can't 'objectively' both-sides this. The IDF is a modern military with internal accountability mechanisms in a democratic country with a free press and generally impartial criminal justice system. Hamas/Hezbollah aren't any of those things.",
                        "body_html": "<div class=\"md\"><p>IDF and Hamas/Hezbollah aren&#39;t on the same level of credibility by a long shot, though. You can&#39;t &#39;objectively&#39; both-sides this. The IDF is a modern military with internal accountability mechanisms in a democratic country with a free press and generally impartial criminal justice system. Hamas/Hezbollah aren&#39;t any of those things.</p>\n</div>",
                        "created_utc": "2024-07-27 23:13:25",
                        "distinguished": null,
                        "edited": false,
                        "id": "lfaud8p",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lfalsj2",
                        "score": 1,
                        "stickied": false,
                        "replies": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "u/OpenOb",
                "body": "Hezbollah has total control over Southern Lebanon. Nothing happens in Southern Lebanon without Hezbollahs approval.\n\nHezbollah also proudly boasted about the attack, until they realized what indiscriminate rocket attacks achieve:\n\n>Yet just after the attack, Hezbollah claimed an attack in the same area\n\n[https://x.com/michaelh992/status/1817248428725809579](https://x.com/michaelh992/status/1817248428725809579)\n\nAnd the IDF has already checked the site and identified the rocket. Nobody in Southern Lebanon drives around with such a rocket without Hezbollahs approval.\n\n>\"A Falaq-1 rocket struck here in the soccer field, it is an Iranian rocket, manufactured in Iran, a rocket with a warhead of over 50 kilograms of explosives,\" Hagari says in a press conference at the scene.\n\n>\"The forensic findings at the scene point to this rocket. Falaq-1 is only in use by the Hezbollah terror group, which carried out this attack from Chebaa,\" he says.\n\n>Hezbollah in an earlier statement said it fired one Falaq rocket at an Israeli army base just north of Majdal Shams, and later denied attacking the town.\n\n[https://x.com/manniefabian/status/1817310269728592027](https://x.com/manniefabian/status/1817310269728592027)\n\n\\*Edit\\*\n\nThe US confirms also the responsibility of Hezbollah\n\n>US official tells Al Arabiya the missile that killed several in Majdal Shams was undoubtedly from Hezbollah. It’s unclear if it was a mistake, but assessed to have been launched by the group.\n\n[https://x.com/jhaboush/status/1817316592847298678](https://x.com/jhaboush/status/1817316592847298678)",
                "body_html": "<div class=\"md\"><p>Hezbollah has total control over Southern Lebanon. Nothing happens in Southern Lebanon without Hezbollahs approval.</p>\n\n<p>Hezbollah also proudly boasted about the attack, until they realized what indiscriminate rocket attacks achieve:</p>\n\n<blockquote>\n<p>Yet just after the attack, Hezbollah claimed an attack in the same area</p>\n</blockquote>\n\n<p><a href=\"https://x.com/michaelh992/status/1817248428725809579\">https://x.com/michaelh992/status/1817248428725809579</a></p>\n\n<p>And the IDF has already checked the site and identified the rocket. Nobody in Southern Lebanon drives around with such a rocket without Hezbollahs approval.</p>\n\n<blockquote>\n<p>&quot;A Falaq-1 rocket struck here in the soccer field, it is an Iranian rocket, manufactured in Iran, a rocket with a warhead of over 50 kilograms of explosives,&quot; Hagari says in a press conference at the scene.</p>\n\n<p>&quot;The forensic findings at the scene point to this rocket. Falaq-1 is only in use by the Hezbollah terror group, which carried out this attack from Chebaa,&quot; he says.</p>\n\n<p>Hezbollah in an earlier statement said it fired one Falaq rocket at an Israeli army base just north of Majdal Shams, and later denied attacking the town.</p>\n</blockquote>\n\n<p><a href=\"https://x.com/manniefabian/status/1817310269728592027\">https://x.com/manniefabian/status/1817310269728592027</a></p>\n\n<p>*Edit*</p>\n\n<p>The US confirms also the responsibility of Hezbollah</p>\n\n<blockquote>\n<p>US official tells Al Arabiya the missile that killed several in Majdal Shams was undoubtedly from Hezbollah. It’s unclear if it was a mistake, but assessed to have been launched by the group.</p>\n</blockquote>\n\n<p><a href=\"https://x.com/jhaboush/status/1817316592847298678\">https://x.com/jhaboush/status/1817316592847298678</a></p>\n</div>",
                "created_utc": "2024-07-27 14:33:30",
                "distinguished": null,
                "edited": "2024-07-27 15:06:22",
                "id": "lf8woo2",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8odev",
                "score": 52,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Rhauko",
                    "body": "So despite the claims Hezbollah makes the evidence points in their direction. Not really surprising.",
                    "body_html": "<div class=\"md\"><p>So despite the claims Hezbollah makes the evidence points in their direction. Not really surprising.</p>\n</div>",
                    "created_utc": "2024-07-27 21:57:22",
                    "distinguished": null,
                    "edited": false,
                    "id": "lfamdfm",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8woo2",
                    "score": 3,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "u/ferrel_hadley",
        "body": ">Now it has spy drones such as Zala, Supercam and Orlans that can send real-time images from deep inside Ukrainian territory, avoiding Ukraine’s electronic detection and jamming systems.\n\n>Drone unit commander Oleksandr Karpyuk says the drones can now be pre-programmed to fly long distance in radio silence.\n\n>Russian defence ministry video showing the attack on Myrhorod airbase earlier this month appears to show the moment Iskander ballistic missiles hit the area where several jets were parked.\n\n[https://www.bbc.co.uk/news/articles/c0kr240gd18o](https://www.bbc.co.uk/news/articles/c0kr240gd18o)\n\n  \nInteresting tit bit from a generic piece on Ukrainian and the F16 saga. Seems the Russians are now using some of their drones to fly preselected paths and basically do old school photo recon operations. Ukraine has access to the Maxar and PlanetLabs constellations of small sats doing Earth imaging, they also likely have pretty good access to the KH-11s that have very very good image quality so have a much lower need for this kind of thing. \n\nWhat is interesting is that it seems that Ukrainian radar is not picking them up? Perhaps too slow and low from the big Patriot radars etc. Perhaps too small for the S-300s if you steer a path round them? speculative and its hard to guess how deep they are penetrating. May simply be they dont have enough missiles to deal with them and they do not follow the paths defended by the Gepards.",
        "body_html": "<div class=\"md\"><blockquote>\n<p>Now it has spy drones such as Zala, Supercam and Orlans that can send real-time images from deep inside Ukrainian territory, avoiding Ukraine’s electronic detection and jamming systems.</p>\n\n<p>Drone unit commander Oleksandr Karpyuk says the drones can now be pre-programmed to fly long distance in radio silence.</p>\n\n<p>Russian defence ministry video showing the attack on Myrhorod airbase earlier this month appears to show the moment Iskander ballistic missiles hit the area where several jets were parked.</p>\n</blockquote>\n\n<p><a href=\"https://www.bbc.co.uk/news/articles/c0kr240gd18o\">https://www.bbc.co.uk/news/articles/c0kr240gd18o</a></p>\n\n<p>Interesting tit bit from a generic piece on Ukrainian and the F16 saga. Seems the Russians are now using some of their drones to fly preselected paths and basically do old school photo recon operations. Ukraine has access to the Maxar and PlanetLabs constellations of small sats doing Earth imaging, they also likely have pretty good access to the KH-11s that have very very good image quality so have a much lower need for this kind of thing. </p>\n\n<p>What is interesting is that it seems that Ukrainian radar is not picking them up? Perhaps too slow and low from the big Patriot radars etc. Perhaps too small for the S-300s if you steer a path round them? speculative and its hard to guess how deep they are penetrating. May simply be they dont have enough missiles to deal with them and they do not follow the paths defended by the Gepards.</p>\n</div>",
        "created_utc": "2024-07-28 02:21:23",
        "distinguished": null,
        "edited": false,
        "id": "lfbb36f",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 29,
        "stickied": false,
        "replies": [
          {
            "author": "u/Aegrotare2",
            "body": ">Seems the Russians are now using some of their drones to fly preselected paths and basically do old school photo recon operations.\n\nI dont think so, I read it that the Orlansbreak their radiosilence above the Target, so the russians still have real time viedeo.",
            "body_html": "<div class=\"md\"><blockquote>\n<p>Seems the Russians are now using some of their drones to fly preselected paths and basically do old school photo recon operations.</p>\n</blockquote>\n\n<p>I dont think so, I read it that the Orlansbreak their radiosilence above the Target, so the russians still have real time viedeo.</p>\n</div>",
            "created_utc": "2024-07-28 02:41:16",
            "distinguished": null,
            "edited": false,
            "id": "lfbcpy2",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lfbb36f",
            "score": 12,
            "stickied": false,
            "replies": []
          }
        ]
      },
      {
        "author": "u/Haha-Hehe-Lolo",
        "body": "**A Mysterious Plot Prompts a Rare Call From Russia to the Pentagon - The New York Times**\n\n*Russia’s defense minister said he needed to talk to Defense Secretary Lloyd Austin about an alleged Ukrainian operation. What happened next remains murky.*\n\n[https://www.nytimes.com/2024/07/26/us/politics/austin-russia-ukraine-defense-plot.html](https://www.nytimes.com/2024/07/26/us/politics/austin-russia-ukraine-defense-plot.html)\n\n>On July 12, Mr. Belousov *\\[new Russian Minister of Defence\\]* was calling to relay a warning, according to two U.S. officials and another official briefed on the call: The Russians had detected a Ukrainian covert operation in the works against Russia that they believed had the Americans’ blessing. Was the Pentagon aware of the plot, Mr. Belousov asked Mr. Austin, and its potential to ratchet up tensions between Moscow and Washington?  \n>  \n>Pentagon officials were surprised by the allegation and unaware of any such plot, the two U.S. officials said, speaking on the condition of anonymity to discuss the confidential phone call. But whatever Mr. Belousov revealed, all three officials said, it was taken seriously enough that ***the Americans contacted the Ukrainians and said, essentially, if you’re thinking about doing something like this, don’t***.  \n>  \n>A Russian Defense Ministry statement after the July 12 call confirmed that Mr. Belousov initiated it, adding that “the issue of preventing security threats and **reducing the risk of possible escalation** was discussed.” But the statement made no mention of a suspected Ukrainian covert mission.",
        "body_html": "<div class=\"md\"><p><strong>A Mysterious Plot Prompts a Rare Call From Russia to the Pentagon - The New York Times</strong></p>\n\n<p><em>Russia’s defense minister said he needed to talk to Defense Secretary Lloyd Austin about an alleged Ukrainian operation. What happened next remains murky.</em></p>\n\n<p><a href=\"https://www.nytimes.com/2024/07/26/us/politics/austin-russia-ukraine-defense-plot.html\">https://www.nytimes.com/2024/07/26/us/politics/austin-russia-ukraine-defense-plot.html</a></p>\n\n<blockquote>\n<p>On July 12, Mr. Belousov <em>[new Russian Minister of Defence]</em> was calling to relay a warning, according to two U.S. officials and another official briefed on the call: The Russians had detected a Ukrainian covert operation in the works against Russia that they believed had the Americans’ blessing. Was the Pentagon aware of the plot, Mr. Belousov asked Mr. Austin, and its potential to ratchet up tensions between Moscow and Washington?  </p>\n\n<p>Pentagon officials were surprised by the allegation and unaware of any such plot, the two U.S. officials said, speaking on the condition of anonymity to discuss the confidential phone call. But whatever Mr. Belousov revealed, all three officials said, it was taken seriously enough that <strong><em>the Americans contacted the Ukrainians and said, essentially, if you’re thinking about doing something like this, don’t</em></strong>.  </p>\n\n<p>A Russian Defense Ministry statement after the July 12 call confirmed that Mr. Belousov initiated it, adding that “the issue of preventing security threats and <strong>reducing the risk of possible escalation</strong> was discussed.” But the statement made no mention of a suspected Ukrainian covert mission.</p>\n</blockquote>\n</div>",
        "created_utc": "2024-07-27 07:41:35",
        "distinguished": null,
        "edited": false,
        "id": "lf70hsy",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 61,
        "stickied": false,
        "replies": [
          {
            "author": "u/Tifoso89",
            "body": "Interesting. We can only speculate, but it seems to me there are only two options:\n\n1) Good ol' Russian disinformation \n\n2) The Ukrainians were indeed preparing something big that the US wouldn't approve of",
            "body_html": "<div class=\"md\"><p>Interesting. We can only speculate, but it seems to me there are only two options:</p>\n\n<p>1) Good ol&#39; Russian disinformation </p>\n\n<p>2) The Ukrainians were indeed preparing something big that the US wouldn&#39;t approve of</p>\n</div>",
            "created_utc": "2024-07-27 08:42:59",
            "distinguished": null,
            "edited": false,
            "id": "lf7avqt",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf70hsy",
            "score": 49,
            "stickied": false,
            "replies": [
              {
                "author": "u/stult",
                "body": "Or 3) The Ukrainians were indeed preparing something big that the US doesn't care about. Just because Russia complained doesn't mean the planned attack wasn't/isn't completely legitimate and legal.",
                "body_html": "<div class=\"md\"><p>Or 3) The Ukrainians were indeed preparing something big that the US doesn&#39;t care about. Just because Russia complained doesn&#39;t mean the planned attack wasn&#39;t/isn&#39;t completely legitimate and legal.</p>\n</div>",
                "created_utc": "2024-07-27 12:09:17",
                "distinguished": null,
                "edited": false,
                "id": "lf89fto",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7avqt",
                "score": 34,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Tifoso89",
                    "body": "The NYT report however says that the US contacted the Ukrainians and told them not to do whatever they were going to do",
                    "body_html": "<div class=\"md\"><p>The NYT report however says that the US contacted the Ukrainians and told them not to do whatever they were going to do</p>\n</div>",
                    "created_utc": "2024-07-27 12:20:13",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf8b71k",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf89fto",
                    "score": 19,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/stult",
                        "body": "Which isn't necessarily reflective of the true position of US officials. They could simply have been telling the Ukrainians to hold off because the Russians were aware of and preparing for the attack rather than because they disapprove, or it could have been a \"wink, wink, nudge, nudge\" type of warning.",
                        "body_html": "<div class=\"md\"><p>Which isn&#39;t necessarily reflective of the true position of US officials. They could simply have been telling the Ukrainians to hold off because the Russians were aware of and preparing for the attack rather than because they disapprove, or it could have been a &quot;wink, wink, nudge, nudge&quot; type of warning.</p>\n</div>",
                        "created_utc": "2024-07-27 12:50:43",
                        "distinguished": null,
                        "edited": false,
                        "id": "lf8g404",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf8b71k",
                        "score": 23,
                        "stickied": false,
                        "replies": [
                          {
                            "author": "u/ChornWork2",
                            "body": "The americans don't want to be seen as telling the ukrainians to do, or not to do, anything.  For this to get talked about, my guess this is something the americans really didn't think was a good idea and they're annoyed at ukraine.",
                            "body_html": "<div class=\"md\"><p>The americans don&#39;t want to be seen as telling the ukrainians to do, or not to do, anything.  For this to get talked about, my guess this is something the americans really didn&#39;t think was a good idea and they&#39;re annoyed at ukraine.</p>\n</div>",
                            "created_utc": "2024-07-27 22:47:12",
                            "distinguished": null,
                            "edited": false,
                            "id": "lfarsd4",
                            "is_submitter": false,
                            "link_id": "t3_1edeq4c",
                            "parent_id": "t1_lf8g404",
                            "score": 6,
                            "stickied": false,
                            "replies": [
                              {
                                "author": "[deleted]",
                                "body": "My feeling is they were planning some kind of attack on an element of Russia's nuclear deterrent.",
                                "body_html": "<div class=\"md\"><p>My feeling is they were planning some kind of attack on an element of Russia&#39;s nuclear deterrent.</p>\n</div>",
                                "created_utc": "2024-07-28 16:08:33",
                                "distinguished": null,
                                "edited": false,
                                "id": "lfep9d9",
                                "is_submitter": false,
                                "link_id": "t3_1edeq4c",
                                "parent_id": "t1_lfarsd4",
                                "score": 1,
                                "stickied": false,
                                "replies": []
                              }
                            ]
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "author": "[deleted]",
                "body": "[deleted]",
                "body_html": "<div class=\"md\"><p>[deleted]</p>\n</div>",
                "created_utc": "2024-07-27 08:49:10",
                "distinguished": null,
                "edited": false,
                "id": "lf7bxy6",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7avqt",
                "score": -3,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Dangerous_Golf_7417",
                    "body": "I'm no DC insider, but I'm fairly certain an assassination of Putin would decidedly not be fine with the US. Plunging Russia into that kind of chaos would be insane, especially if there was any indication the US knew about/approved the effort. ",
                    "body_html": "<div class=\"md\"><p>I&#39;m no DC insider, but I&#39;m fairly certain an assassination of Putin would decidedly not be fine with the US. Plunging Russia into that kind of chaos would be insane, especially if there was any indication the US knew about/approved the effort. </p>\n</div>",
                    "created_utc": "2024-07-27 09:02:05",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7e5gs",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7bxy6",
                    "score": 12,
                    "stickied": false,
                    "replies": []
                  },
                  {
                    "author": "u/SuperBlaar",
                    "body": "Assassination attempts against Putin would absolutely not be fine with the US, it's exactly the kind of scenario the US will want to prevent, it's the reddest of lines and I doubt Ukraine would attempt crossing it.\n\nIt could be anything - more attacks on early warning systems or other installations linked to Russia's nuclear arsenal, assassinations of MoD officials/generals or economic/political elites, killing of Russian MIC leaders, an attack on a power plant, or a civilian heavy military facility like Alabuga..\n\nUnless more details are provided we can only speculate, but the US generally seems to disapprove of assassinations or targetting of Russian elite (they reportedly stopped Ukraine from an attempt at killing Gerasimov in 2022), or anything which is seen as too escalatory or possibly destabilizing for Russia.",
                    "body_html": "<div class=\"md\"><p>Assassination attempts against Putin would absolutely not be fine with the US, it&#39;s exactly the kind of scenario the US will want to prevent, it&#39;s the reddest of lines and I doubt Ukraine would attempt crossing it.</p>\n\n<p>It could be anything - more attacks on early warning systems or other installations linked to Russia&#39;s nuclear arsenal, assassinations of MoD officials/generals or economic/political elites, killing of Russian MIC leaders, an attack on a power plant, or a civilian heavy military facility like Alabuga..</p>\n\n<p>Unless more details are provided we can only speculate, but the US generally seems to disapprove of assassinations or targetting of Russian elite (they reportedly stopped Ukraine from an attempt at killing Gerasimov in 2022), or anything which is seen as too escalatory or possibly destabilizing for Russia.</p>\n</div>",
                    "created_utc": "2024-07-27 09:03:08",
                    "distinguished": null,
                    "edited": "2024-07-27 09:12:32",
                    "id": "lf7ec0d",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7bxy6",
                    "score": 17,
                    "stickied": false,
                    "replies": []
                  },
                  {
                    "author": "u/RobotWantsKitty",
                    "body": " \n\n1. Assassinating a prominent civil servant (like Nabiullina)   \n2. Sabotaging strategic assets  \n3. A major symbolic attack that has no practical use  (something like the Main Cathedral of the Russian Armed Forces)  \n4. Sabotaging an atomic power station (least likely scenario by far IMO)   \n \nWhether the US was fine with it is irrelevant, because Russia didn't reach out and warn them before",
                    "body_html": "<div class=\"md\"><ol>\n<li>Assassinating a prominent civil servant (like Nabiullina)<br/></li>\n<li>Sabotaging strategic assets<br/></li>\n<li>A major symbolic attack that has no practical use  (something like the Main Cathedral of the Russian Armed Forces)<br/></li>\n<li>Sabotaging an atomic power station (least likely scenario by far IMO)<br/></li>\n</ol>\n\n<p>Whether the US was fine with it is irrelevant, because Russia didn&#39;t reach out and warn them before</p>\n</div>",
                    "created_utc": "2024-07-27 09:05:47",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7erxi",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7bxy6",
                    "score": 16,
                    "stickied": false,
                    "replies": []
                  },
                  {
                    "author": "u/qwamqwamqwam2",
                    "body": "No, an assassination attempt against Putin would not be fine with the US.",
                    "body_html": "<div class=\"md\"><p>No, an assassination attempt against Putin would not be fine with the US.</p>\n</div>",
                    "created_utc": "2024-07-27 09:01:55",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7e4hs",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7bxy6",
                    "score": 7,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/Technical_Isopod8477",
            "body": "You seemed to have left out very important bits of that article that provide a lot more context. This isn't the first time a Russian Minister of Defense has made a call to the US Sec Def since the full invasion, the last time being a case of disinformation ostensibly meant to discourage American aid to Ukraine going into midterm elections and an Ukraine aid package. \n\n>Then there were the calls on Oct. 21 and Oct. 23, 2022, between Mr. Austin and Mr. Shoigu — the first requested by the Americans, **the second by the Russians.**\n\n>The Pentagon’s summary of the second call stated, “Secretary Austin rejected any pretext for Russian escalation and reaffirmed the value of continued communication amid Russia’s unlawful and unjustified war against Ukraine.”\n\n>**A week later**, The New York Times reported that senior Russian military leaders had recently discussed when and how Moscow might use a tactical nuclear weapon in Ukraine, according to multiple senior American officials.\n\n>**The new intelligence surfaced when Moscow was promoting the baseless notion that Ukraine was planning to use a so-called dirty bomb — a conventional explosive laced with radioactive material.**\n\n>President Vladimir V. Putin of Russia was not a part of the conversations with his generals, which were held as Russia was intensifying nuclear rhetoric and suffering battlefield setbacks.\n\n>But the fact that senior Russian military leaders were even having the discussions alarmed the Biden administration because it showed how frustrated they were about their failures in Ukraine and suggested that Mr. Putin’s veiled threats to use nuclear weapons might not just be words.",
            "body_html": "<div class=\"md\"><p>You seemed to have left out very important bits of that article that provide a lot more context. This isn&#39;t the first time a Russian Minister of Defense has made a call to the US Sec Def since the full invasion, the last time being a case of disinformation ostensibly meant to discourage American aid to Ukraine going into midterm elections and an Ukraine aid package. </p>\n\n<blockquote>\n<p>Then there were the calls on Oct. 21 and Oct. 23, 2022, between Mr. Austin and Mr. Shoigu — the first requested by the Americans, <strong>the second by the Russians.</strong></p>\n\n<p>The Pentagon’s summary of the second call stated, “Secretary Austin rejected any pretext for Russian escalation and reaffirmed the value of continued communication amid Russia’s unlawful and unjustified war against Ukraine.”</p>\n\n<p><strong>A week later</strong>, The New York Times reported that senior Russian military leaders had recently discussed when and how Moscow might use a tactical nuclear weapon in Ukraine, according to multiple senior American officials.</p>\n\n<p><strong>The new intelligence surfaced when Moscow was promoting the baseless notion that Ukraine was planning to use a so-called dirty bomb — a conventional explosive laced with radioactive material.</strong></p>\n\n<p>President Vladimir V. Putin of Russia was not a part of the conversations with his generals, which were held as Russia was intensifying nuclear rhetoric and suffering battlefield setbacks.</p>\n\n<p>But the fact that senior Russian military leaders were even having the discussions alarmed the Biden administration because it showed how frustrated they were about their failures in Ukraine and suggested that Mr. Putin’s veiled threats to use nuclear weapons might not just be words.</p>\n</blockquote>\n</div>",
            "created_utc": "2024-07-27 13:29:36",
            "distinguished": null,
            "edited": false,
            "id": "lf8mfwg",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf70hsy",
            "score": 33,
            "stickied": false,
            "replies": [
              {
                "author": "u/Suspicious_Loads",
                "body": ">Ukraine was planning to use a so-called dirty bomb\n\nIt don't make sense to use a dirty bomb against a foe with nuclear arsenal. Basically giving Russia the casus belli to nuke Ukraine.",
                "body_html": "<div class=\"md\"><blockquote>\n<p>Ukraine was planning to use a so-called dirty bomb</p>\n</blockquote>\n\n<p>It don&#39;t make sense to use a dirty bomb against a foe with nuclear arsenal. Basically giving Russia the casus belli to nuke Ukraine.</p>\n</div>",
                "created_utc": "2024-07-27 14:19:49",
                "distinguished": null,
                "edited": false,
                "id": "lf8ujej",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8mfwg",
                "score": 32,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Lejeune_Dirichelet",
                    "body": "It only makes sense if Ukraine wants a makeshift second-strike nuclear deterrent. Which, in the context of incessant calls to nuke Ukraine in the Russian media sphere, and of the prospect of the US abandonning Ukraine, is quite rational.",
                    "body_html": "<div class=\"md\"><p>It only makes sense if Ukraine wants a makeshift second-strike nuclear deterrent. Which, in the context of incessant calls to nuke Ukraine in the Russian media sphere, and of the prospect of the US abandonning Ukraine, is quite rational.</p>\n</div>",
                    "created_utc": "2024-07-28 03:19:52",
                    "distinguished": null,
                    "edited": false,
                    "id": "lfbg0m1",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8ujej",
                    "score": 6,
                    "stickied": false,
                    "replies": []
                  }
                ]
              },
              {
                "author": "u/Haha-Hehe-Lolo",
                "body": "I didn’t quote this part of article because this background info is not essential and can be read in the article itself. \n\nThe most important part is that this time the US authorities did act on the Russian information.",
                "body_html": "<div class=\"md\"><p>I didn’t quote this part of article because this background info is not essential and can be read in the article itself. </p>\n\n<p>The most important part is that this time the US authorities did act on the Russian information.</p>\n</div>",
                "created_utc": "2024-07-27 13:50:53",
                "distinguished": null,
                "edited": false,
                "id": "lf8pxzh",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8mfwg",
                "score": 5,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Technical_Isopod8477",
                    "body": "Sorry, you don't think it's important that the prior case of a call, which the article you chose to share states was rooted in a \"baseless notion\", is important context? I find that very hard to believe. It's very much essential in understanding a possible motive behind this call. \n\n>The most important part is that this time the US authorities did act on the Russian information.\n\nWe have no idea what the US did the last time. Since what the US did matters, the story also says the following:\n\n>But two officials familiar with the call said Mr. Austin also warned his Russian counterpart not to threaten U.S. troops in Europe amid rising tensions in Ukraine.\n\nThe article says plainly there is no indication whether a Ukrainian operation even existed. Which does not mean the Sec Def was wrong in having a conversation with his counterpart. I would do the same. That's neither here nor there.",
                    "body_html": "<div class=\"md\"><p>Sorry, you don&#39;t think it&#39;s important that the prior case of a call, which the article you chose to share states was rooted in a &quot;baseless notion&quot;, is important context? I find that very hard to believe. It&#39;s very much essential in understanding a possible motive behind this call. </p>\n\n<blockquote>\n<p>The most important part is that this time the US authorities did act on the Russian information.</p>\n</blockquote>\n\n<p>We have no idea what the US did the last time. Since what the US did matters, the story also says the following:</p>\n\n<blockquote>\n<p>But two officials familiar with the call said Mr. Austin also warned his Russian counterpart not to threaten U.S. troops in Europe amid rising tensions in Ukraine.</p>\n</blockquote>\n\n<p>The article says plainly there is no indication whether a Ukrainian operation even existed. Which does not mean the Sec Def was wrong in having a conversation with his counterpart. I would do the same. That&#39;s neither here nor there.</p>\n</div>",
                    "created_utc": "2024-07-27 14:03:03",
                    "distinguished": null,
                    "edited": "2024-07-27 14:06:45",
                    "id": "lf8rwfy",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8pxzh",
                    "score": 10,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/Tricky-Astronaut",
            "body": "Russia claims that Ukraine was plotting to [sabotage](https://www.themoscowtimes.com/2024/07/10/fsb-says-thwarted-plots-targeting-army-officials-admiral-kuznetsov-aircraft-carrier-a85668) Admiral Kuznetsov, Russia's only aircraft carrier. However, there's no proof that Ukraine actually planned to do this.",
            "body_html": "<div class=\"md\"><p>Russia claims that Ukraine was plotting to <a href=\"https://www.themoscowtimes.com/2024/07/10/fsb-says-thwarted-plots-targeting-army-officials-admiral-kuznetsov-aircraft-carrier-a85668\">sabotage</a> Admiral Kuznetsov, Russia&#39;s only aircraft carrier. However, there&#39;s no proof that Ukraine actually planned to do this.</p>\n</div>",
            "created_utc": "2024-07-27 08:38:15",
            "distinguished": null,
            "edited": false,
            "id": "lf7a2l5",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf70hsy",
            "score": 31,
            "stickied": false,
            "replies": [
              {
                "author": "u/Sulla-proconsul",
                "body": "What for? After they dropped that crane on it years ago, it still hasn’t been repaired and likely won’t be, given how often the date for a return to service has been delayed. \n\nAnd frankly, that’s a military target, so there wouldn’t be an objection. I’m guessing either high level assassination attempt, or something that risked civilian collateral damage.",
                "body_html": "<div class=\"md\"><p>What for? After they dropped that crane on it years ago, it still hasn’t been repaired and likely won’t be, given how often the date for a return to service has been delayed. </p>\n\n<p>And frankly, that’s a military target, so there wouldn’t be an objection. I’m guessing either high level assassination attempt, or something that risked civilian collateral damage.</p>\n</div>",
                "created_utc": "2024-07-27 08:56:28",
                "distinguished": null,
                "edited": false,
                "id": "lf7d73u",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7a2l5",
                "score": 58,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Yulong",
                    "body": "Ukraine attacking that floating trash barge would be doing the Russians a favor in terms of garbage disposal. Not only is the thing taking up valuable resources and manpower to maintain and repair, I struggle to think of a universe where an aircraft carrier makes a difference in the war in Ukraine, given the two countries are neighbors.",
                    "body_html": "<div class=\"md\"><p>Ukraine attacking that floating trash barge would be doing the Russians a favor in terms of garbage disposal. Not only is the thing taking up valuable resources and manpower to maintain and repair, I struggle to think of a universe where an aircraft carrier makes a difference in the war in Ukraine, given the two countries are neighbors.</p>\n</div>",
                    "created_utc": "2024-07-27 10:42:38",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7v44c",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7d73u",
                    "score": 45,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/Adventurous-Soil2872",
                        "body": "It’s a gigantic blow to the international prestige of Russia. To be a great power in this day and age you need to have at least one carrier. Even if it’s a piece of shit that can barely move under its own power it’s still a symbol of Russian greatness. To have such a symbol of potency and global relevance destroyed in full view of the population of Murmansk, by saboteurs, is a massive humiliation. \n\nIf a carrier is sunk then it will be front page news around the world and front page news in Russia, no amount of censorship or misdirection can prevent that. I think it’s pretty obvious that one of the last headlines any country wants is their largest warship being sunk, to say nothing of the fact that it’s the flagship of their entire navy. \n\nArguments that it’s actually an economic benefit because of the repair and maintenance costs will convince absolutely no one that it isn’t a catastrophe.",
                        "body_html": "<div class=\"md\"><p>It’s a gigantic blow to the international prestige of Russia. To be a great power in this day and age you need to have at least one carrier. Even if it’s a piece of shit that can barely move under its own power it’s still a symbol of Russian greatness. To have such a symbol of potency and global relevance destroyed in full view of the population of Murmansk, by saboteurs, is a massive humiliation. </p>\n\n<p>If a carrier is sunk then it will be front page news around the world and front page news in Russia, no amount of censorship or misdirection can prevent that. I think it’s pretty obvious that one of the last headlines any country wants is their largest warship being sunk, to say nothing of the fact that it’s the flagship of their entire navy. </p>\n\n<p>Arguments that it’s actually an economic benefit because of the repair and maintenance costs will convince absolutely no one that it isn’t a catastrophe.</p>\n</div>",
                        "created_utc": "2024-07-27 11:10:39",
                        "distinguished": null,
                        "edited": false,
                        "id": "lf7zv8x",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf7v44c",
                        "score": 16,
                        "stickied": false,
                        "replies": [
                          {
                            "author": "u/RobotWantsKitty",
                            "body": ">It’s a gigantic blow to the international prestige of Russia. To be a great power in this day and age you need to have at least one carrier. \n\nI disagree, Russia is a land power and its projection is not measured in aircraft carriers. That's why even the Soviet Union only had a small handful of them.",
                            "body_html": "<div class=\"md\"><blockquote>\n<p>It’s a gigantic blow to the international prestige of Russia. To be a great power in this day and age you need to have at least one carrier. </p>\n</blockquote>\n\n<p>I disagree, Russia is a land power and its projection is not measured in aircraft carriers. That&#39;s why even the Soviet Union only had a small handful of them.</p>\n</div>",
                            "created_utc": "2024-07-27 13:48:46",
                            "distinguished": null,
                            "edited": "2024-07-27 13:53:26",
                            "id": "lf8plh3",
                            "is_submitter": false,
                            "link_id": "t3_1edeq4c",
                            "parent_id": "t1_lf7zv8x",
                            "score": 9,
                            "stickied": false,
                            "replies": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              },
              {
                "author": "u/Goddamnit_Clown",
                "body": "I imagine Ukraine hopes and attempts to attack any number of things. Why would that be one the US applied pressure to prevent?",
                "body_html": "<div class=\"md\"><p>I imagine Ukraine hopes and attempts to attack any number of things. Why would that be one the US applied pressure to prevent?</p>\n</div>",
                "created_utc": "2024-07-27 09:31:18",
                "distinguished": null,
                "edited": false,
                "id": "lf7j0og",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7a2l5",
                "score": 15,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/LtCdrHipster",
                "body": "If the Ukrainians sabotaged the Kuznetsov, how could anyone even tell? It's a useless rust bucket.",
                "body_html": "<div class=\"md\"><p>If the Ukrainians sabotaged the Kuznetsov, how could anyone even tell? It&#39;s a useless rust bucket.</p>\n</div>",
                "created_utc": "2024-07-27 12:45:36",
                "distinguished": null,
                "edited": false,
                "id": "lf8faa6",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7a2l5",
                "score": 4,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/Route-One-442",
                "body": "Ukraine should clap the Kirov Battlecruiser, not Kuznetsov.",
                "body_html": "<div class=\"md\"><p>Ukraine should clap the Kirov Battlecruiser, not Kuznetsov.</p>\n</div>",
                "created_utc": "2024-07-27 12:35:10",
                "distinguished": null,
                "edited": false,
                "id": "lf8dl99",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7a2l5",
                "score": 1,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/username9909864",
            "body": "Sounds like psy-ops from Russia. \n\nI have a feeling this post is going to lead to a lot of non-credible speculation.",
            "body_html": "<div class=\"md\"><p>Sounds like psy-ops from Russia. </p>\n\n<p>I have a feeling this post is going to lead to a lot of non-credible speculation.</p>\n</div>",
            "created_utc": "2024-07-27 07:51:19",
            "distinguished": null,
            "edited": false,
            "id": "lf7242t",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf70hsy",
            "score": 31,
            "stickied": false,
            "replies": [
              {
                "author": "u/Tropical_Amnesia",
                "body": "There's worse sources than the Times around, including on this sub. Sounds credible enough to me, and how could basically zero substance so far not be? Even so, do you really think this is the first time something like that happened? That Washington initiated panicky alarm calls to Kyiv the very minute they got aware of Prigozhin's intentions, also psy-op from Russia? That the Ukrainians are only allowed aiming delivered long-range weapons at their own territory, also psy-ops from Russia? If people were honest it only hurts them to see Russia doesn't even need any of this to win their biggest war since 1945. All they ever needed was a working phone line into Wash. DC. This is what historians will find, as they rightly rip us to pieces.\n\nKyiv is desperate, that's not hard to relate to, let alone a point of speculation. At the same time they're not yet ready to just accept fate, this the few of us still able to even understand can only envy. These folks actually pack more grit than the entire zombie post-west today! Looking at it this way, it doesn't even matter what they planned, or how much progress there was. Surrounded by snakes on all sides, they'll suffocate.",
                "body_html": "<div class=\"md\"><p>There&#39;s worse sources than the Times around, including on this sub. Sounds credible enough to me, and how could basically zero substance so far not be? Even so, do you really think this is the first time something like that happened? That Washington initiated panicky alarm calls to Kyiv the very minute they got aware of Prigozhin&#39;s intentions, also psy-op from Russia? That the Ukrainians are only allowed aiming delivered long-range weapons at their own territory, also psy-ops from Russia? If people were honest it only hurts them to see Russia doesn&#39;t even need any of this to win their biggest war since 1945. All they ever needed was a working phone line into Wash. DC. This is what historians will find, as they rightly rip us to pieces.</p>\n\n<p>Kyiv is desperate, that&#39;s not hard to relate to, let alone a point of speculation. At the same time they&#39;re not yet ready to just accept fate, this the few of us still able to even understand can only envy. These folks actually pack more grit than the entire zombie post-west today! Looking at it this way, it doesn&#39;t even matter what they planned, or how much progress there was. Surrounded by snakes on all sides, they&#39;ll suffocate.</p>\n</div>",
                "created_utc": "2024-07-27 08:29:39",
                "distinguished": null,
                "edited": false,
                "id": "lf78ljh",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7242t",
                "score": 22,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/DragonCrisis",
                    "body": "Anonymous sources are one thing, but talking about a plan which may or may not have existed to carry out an unspecified action that wasn't executed hardly qualifies as news\n\nThe question really is \"in what direction do the NYT editors seek to influence public opinion by publishing this\"",
                    "body_html": "<div class=\"md\"><p>Anonymous sources are one thing, but talking about a plan which may or may not have existed to carry out an unspecified action that wasn&#39;t executed hardly qualifies as news</p>\n\n<p>The question really is &quot;in what direction do the NYT editors seek to influence public opinion by publishing this&quot;</p>\n</div>",
                    "created_utc": "2024-07-27 09:36:16",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7jubs",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf78ljh",
                    "score": 18,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "u/Well-Sourced",
        "body": "Some photos showing how MiGs were adapted for SDBs.  Soviet fighters being adapted for western weapons is still one of the more interesting and unlikely things to come out of the Russia-Ukraine War.\n\n[How Ukraine's MiG-29s Were Adapted For SDB Bombs (Photo) | Defense Express | July 2024](https://en.defence-ua.com/weapon_and_tech/how_ukraines_mig_29s_were_adapted_for_sdb_bombs_photo-11314.html)\n\n*A photo has surfaced illustrating how SDB (Small Diameter Bomb) guided aerial bombs, otherwise known as GBU-39, are suspended under the MiG-29 aircraft of the Armed Forces of Ukraine. The picture reveals modernizations applied to this fighter to enable the use of SDB.*\n\n*The first indications of the potential adaptation of the MiG-29 to carry GBU-39 bombs emerged in public domain in late May 2024. Journalists mentioned that these guided aerial bombs could have been used against russian forces starting as early as February 2024.*\n\n*However, up until now, there have been very few images publicly available that confirm the adaptation of the MiG-29 for the GBU-39. The new detailed picture of the MiG-29 with integrated SDBs comes from the Air_Winged profile on X social media.*\n\n*In the photo, the GBU-39 bombs are mounted on a standard BRU-61/A rack, which can hold up to four of these aerial munitions. Notably, the pylon-adapter appears to differ slightly from the pylon used for the JDAM-ER (Joint Direct Attack Munition – Extended Range) on the same aircraft model.*\n\n*Still, it's quite likely that the integration of the SDB might have been developed using the same technical solutions as in the case with the JDAM-ER.*\n\n*There are also reports suggesting the possible integration of the GBU-39 on Ukrainian Su-27 fighters. However, the photos supporting these claims only show the pylon configuration, which could be used for such an upgrade but do not confirm the integration itself.*\n\n*For a brief reminder, the GBU-39 bombs have a weight of 130 kilograms and a declared maximum range of 110 kilometers when dropped from an altitude of 12 kilometers. The practical range of the SDB when used from Ukrainian planes, which tend to stay much lower for safety, remains unknown.*\n\n*A notable technological paradox is that the SDB bombs are also a component of the GLSDB (Ground-Launched Small Diameter Bomb) missile system. However, air-dropped munitions exhibit better accuracy when deployed from aircraft. This paradox and the reasons behind it were explored in a separate article by Defense Express.*",
        "body_html": "<div class=\"md\"><p>Some photos showing how MiGs were adapted for SDBs.  Soviet fighters being adapted for western weapons is still one of the more interesting and unlikely things to come out of the Russia-Ukraine War.</p>\n\n<p><a href=\"https://en.defence-ua.com/weapon_and_tech/how_ukraines_mig_29s_were_adapted_for_sdb_bombs_photo-11314.html\">How Ukraine&#39;s MiG-29s Were Adapted For SDB Bombs (Photo) | Defense Express | July 2024</a></p>\n\n<p><em>A photo has surfaced illustrating how SDB (Small Diameter Bomb) guided aerial bombs, otherwise known as GBU-39, are suspended under the MiG-29 aircraft of the Armed Forces of Ukraine. The picture reveals modernizations applied to this fighter to enable the use of SDB.</em></p>\n\n<p><em>The first indications of the potential adaptation of the MiG-29 to carry GBU-39 bombs emerged in public domain in late May 2024. Journalists mentioned that these guided aerial bombs could have been used against russian forces starting as early as February 2024.</em></p>\n\n<p><em>However, up until now, there have been very few images publicly available that confirm the adaptation of the MiG-29 for the GBU-39. The new detailed picture of the MiG-29 with integrated SDBs comes from the Air_Winged profile on X social media.</em></p>\n\n<p><em>In the photo, the GBU-39 bombs are mounted on a standard BRU-61/A rack, which can hold up to four of these aerial munitions. Notably, the pylon-adapter appears to differ slightly from the pylon used for the JDAM-ER (Joint Direct Attack Munition – Extended Range) on the same aircraft model.</em></p>\n\n<p><em>Still, it&#39;s quite likely that the integration of the SDB might have been developed using the same technical solutions as in the case with the JDAM-ER.</em></p>\n\n<p><em>There are also reports suggesting the possible integration of the GBU-39 on Ukrainian Su-27 fighters. However, the photos supporting these claims only show the pylon configuration, which could be used for such an upgrade but do not confirm the integration itself.</em></p>\n\n<p><em>For a brief reminder, the GBU-39 bombs have a weight of 130 kilograms and a declared maximum range of 110 kilometers when dropped from an altitude of 12 kilometers. The practical range of the SDB when used from Ukrainian planes, which tend to stay much lower for safety, remains unknown.</em></p>\n\n<p><em>A notable technological paradox is that the SDB bombs are also a component of the GLSDB (Ground-Launched Small Diameter Bomb) missile system. However, air-dropped munitions exhibit better accuracy when deployed from aircraft. This paradox and the reasons behind it were explored in a separate article by Defense Express.</em></p>\n</div>",
        "created_utc": "2024-07-27 16:04:52",
        "distinguished": null,
        "edited": false,
        "id": "lf9agoy",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 38,
        "stickied": false,
        "replies": []
      },
      {
        "author": "u/ferrel_hadley",
        "body": ">ATM services were knocked out at top Russian banks on Saturday, July 27, day five of a large-scale Ukrainian [cyberattack](https://www.kyivpost.com/topic/cyberattack), a source working in Ukrainian intelligence told Kyiv Post.\n\n>The customers of several Russian banks couldn’t withdraw cash, because when attempting to use ATMs, their debit and credit cards were immediately blocked, the source said in written comments.\n\n>“An unprecedented attack by cyber specialists of the Main Intelligence Directorate of the Ministry of Defense of Ukraine \\[[HUR](https://www.kyivpost.com/topic/hur)\\] on the russian banking sector, which is involved in financing the [armed aggression](https://www.kyivpost.com/topic/war-in-ukraine) of the russian federation, has been going on for several days in a row,” it said.\n\n[Ukraine Hacks ATMs Across Russia in Ongoing Massive Cyberattack (kyivpost.com)](https://www.kyivpost.com/post/36471)\n\n  \nIs this credible? Seems to be a bit of a reversal of the much touted Russian cyber warfare.",
        "body_html": "<div class=\"md\"><blockquote>\n<p>ATM services were knocked out at top Russian banks on Saturday, July 27, day five of a large-scale Ukrainian <a href=\"https://www.kyivpost.com/topic/cyberattack\">cyberattack</a>, a source working in Ukrainian intelligence told Kyiv Post.</p>\n\n<p>The customers of several Russian banks couldn’t withdraw cash, because when attempting to use ATMs, their debit and credit cards were immediately blocked, the source said in written comments.</p>\n\n<p>“An unprecedented attack by cyber specialists of the Main Intelligence Directorate of the Ministry of Defense of Ukraine [<a href=\"https://www.kyivpost.com/topic/hur\">HUR</a>] on the russian banking sector, which is involved in financing the <a href=\"https://www.kyivpost.com/topic/war-in-ukraine\">armed aggression</a> of the russian federation, has been going on for several days in a row,” it said.</p>\n</blockquote>\n\n<p><a href=\"https://www.kyivpost.com/post/36471\">Ukraine Hacks ATMs Across Russia in Ongoing Massive Cyberattack (kyivpost.com)</a></p>\n\n<p>Is this credible? Seems to be a bit of a reversal of the much touted Russian cyber warfare.</p>\n</div>",
        "created_utc": "2024-07-27 14:15:14",
        "distinguished": null,
        "edited": false,
        "id": "lf8tt6a",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 53,
        "stickied": false,
        "replies": [
          {
            "author": "u/SuperBlaar",
            "body": "There have been massive DDoS attacks over the last days which have disrupted most banking sites and apps, but I haven't seen anything about ATMs not working or a more complex type of cyberattack being at play.",
            "body_html": "<div class=\"md\"><p>There have been massive DDoS attacks over the last days which have disrupted most banking sites and apps, but I haven&#39;t seen anything about ATMs not working or a more complex type of cyberattack being at play.</p>\n</div>",
            "created_utc": "2024-07-27 15:31:15",
            "distinguished": null,
            "edited": false,
            "id": "lf95h14",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8tt6a",
            "score": 22,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/ishouldvent",
            "body": "The more logical solution would’ve been for these atms to spit out cash instead of locking it. But I assume locking an ATM is easier than making it a money generator",
            "body_html": "<div class=\"md\"><p>The more logical solution would’ve been for these atms to spit out cash instead of locking it. But I assume locking an ATM is easier than making it a money generator</p>\n</div>",
            "created_utc": "2024-07-27 17:42:18",
            "distinguished": null,
            "edited": false,
            "id": "lf9oxfg",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8tt6a",
            "score": 20,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/RobotWantsKitty",
            "body": "> Is this credible? \n\nDoesn't seem like anyone reporting on this or discussing this in RuNet, so it's likely not true. Reminds me of that time when on the day of the major attack against Kyivstar they claimed that [\"cyber units of Ukraine’s Defence Intelligence attacked the tax system of Russia and managed to destroy the entire database and its backup copies\"](https://www.pravda.com.ua/eng/news/2023/12/12/7432737/), but in reality the work of tax services wasn't interrupted in any way.",
            "body_html": "<div class=\"md\"><blockquote>\n<p>Is this credible? </p>\n</blockquote>\n\n<p>Doesn&#39;t seem like anyone reporting on this or discussing this in RuNet, so it&#39;s likely not true. Reminds me of that time when on the day of the major attack against Kyivstar they claimed that <a href=\"https://www.pravda.com.ua/eng/news/2023/12/12/7432737/\">&quot;cyber units of Ukraine’s Defence Intelligence attacked the tax system of Russia and managed to destroy the entire database and its backup copies&quot;</a>, but in reality the work of tax services wasn&#39;t interrupted in any way.</p>\n</div>",
            "created_utc": "2024-07-27 14:39:41",
            "distinguished": null,
            "edited": false,
            "id": "lf8xnxo",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8tt6a",
            "score": 21,
            "stickied": false,
            "replies": [
              {
                "author": "u/mishka5566",
                "body": ">but in reality the work of tax services wasn't interrupted in any way.\n\nno interruptions...the link you shared literally has a screenshot of the service being down. also\n\n\n>The contact center of the Federal Tax Service confirmed to Port that users may experience problems with access to online services, but declined to name the reasons. When asked directly whether the technical difficulties were related to the hacker attack, we were offered to write an official request to the press service of the agency. Often such requests are simply ignored by Russian officials.\n\nt. me/port_media/699",
                "body_html": "<div class=\"md\"><blockquote>\n<p>but in reality the work of tax services wasn&#39;t interrupted in any way.</p>\n</blockquote>\n\n<p>no interruptions...the link you shared literally has a screenshot of the service being down. also</p>\n\n<blockquote>\n<p>The contact center of the Federal Tax Service confirmed to Port that users may experience problems with access to online services, but declined to name the reasons. When asked directly whether the technical difficulties were related to the hacker attack, we were offered to write an official request to the press service of the agency. Often such requests are simply ignored by Russian officials.</p>\n</blockquote>\n\n<p>t. me/port_media/699</p>\n</div>",
                "created_utc": "2024-07-27 15:23:31",
                "distinguished": null,
                "edited": false,
                "id": "lf94c9g",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8xnxo",
                "score": 24,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/RobotWantsKitty",
                    "body": "> no interruptions...the link you shared literally has a screenshot of the service being down\n\nHow is a screenshot evidence of anything? It's easily manufactured. And it's the first time I'm seeing this telegram channel, are there any more reports by someone more prominent than a channel with 1500 subs?  Because they officially denied any technical difficulties or breaches, it would be strange for their support to claim otherwise.  \nkommersant.ru/doc/6396113   \n It's not like those services are never down, but when they are, it's reported.  \nfontanka. ru/2024/04/25/73503779/\n\nThe fact of the matter is, with how popular those online services are, and how destructive wiping their databases with backups would be, it's something that would be plain to see. Just look at Kyivstar, nobody needed to contact their support to ascertain whether the cyberattack was a success.",
                    "body_html": "<div class=\"md\"><blockquote>\n<p>no interruptions...the link you shared literally has a screenshot of the service being down</p>\n</blockquote>\n\n<p>How is a screenshot evidence of anything? It&#39;s easily manufactured. And it&#39;s the first time I&#39;m seeing this telegram channel, are there any more reports by someone more prominent than a channel with 1500 subs?  Because they officially denied any technical difficulties or breaches, it would be strange for their support to claim otherwise.<br/>\nkommersant.ru/doc/6396113<br/>\n It&#39;s not like those services are never down, but when they are, it&#39;s reported.<br/>\nfontanka. ru/2024/04/25/73503779/</p>\n\n<p>The fact of the matter is, with how popular those online services are, and how destructive wiping their databases with backups would be, it&#39;s something that would be plain to see. Just look at Kyivstar, nobody needed to contact their support to ascertain whether the cyberattack was a success.</p>\n</div>",
                    "created_utc": "2024-07-27 16:14:48",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf9bxn3",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf94c9g",
                    "score": 3,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/mishka5566",
                        "body": ">And it's the first time I'm seeing this telegram channel, are there any more reports by someone more prominent than a channel with 1500 subs?\n\nthe reports on the channel came [from meduza](https://meduza.io/news/2023/12/12/ukrainskaya-razvedka-zayavila-chto-vzlomala-federalnuyu-nalogovuyu-sluzhbu-rf). you have shared small channels like vakulenko before so you know the size of the channel has nothing to do with its reliability. its a news website that focuses on russian ports and shipping, its not going to have a big following. \n\n>Because they officially denied any technical difficulties or breaches, it would be strange for their support to claim otherwise.\n\nthats laughable. rosaviatsia still denies it was ever hacked while numerous channels have reported allegedly how they were hacked and infiltrated by the ukrainians\n\n>it's something that would be plain to see.\n\nyour claim was that \"in reality the work of tax services wasn't interrupted in any way\". we have a credible source confirming that the services were down. im not sure to what extent any damage was done nor can you, seeing that corrupting a database is not something that would be visible to the end user. i can agree tho that it probably didnt do lasting harm but the tone of your response is completely non credible and tinged with the old soviet propaganda of \"nothing happened, nothing to see here\"",
                        "body_html": "<div class=\"md\"><blockquote>\n<p>And it&#39;s the first time I&#39;m seeing this telegram channel, are there any more reports by someone more prominent than a channel with 1500 subs?</p>\n</blockquote>\n\n<p>the reports on the channel came <a href=\"https://meduza.io/news/2023/12/12/ukrainskaya-razvedka-zayavila-chto-vzlomala-federalnuyu-nalogovuyu-sluzhbu-rf\">from meduza</a>. you have shared small channels like vakulenko before so you know the size of the channel has nothing to do with its reliability. its a news website that focuses on russian ports and shipping, its not going to have a big following. </p>\n\n<blockquote>\n<p>Because they officially denied any technical difficulties or breaches, it would be strange for their support to claim otherwise.</p>\n</blockquote>\n\n<p>thats laughable. rosaviatsia still denies it was ever hacked while numerous channels have reported allegedly how they were hacked and infiltrated by the ukrainians</p>\n\n<blockquote>\n<p>it&#39;s something that would be plain to see.</p>\n</blockquote>\n\n<p>your claim was that &quot;in reality the work of tax services wasn&#39;t interrupted in any way&quot;. we have a credible source confirming that the services were down. im not sure to what extent any damage was done nor can you, seeing that corrupting a database is not something that would be visible to the end user. i can agree tho that it probably didnt do lasting harm but the tone of your response is completely non credible and tinged with the old soviet propaganda of &quot;nothing happened, nothing to see here&quot;</p>\n</div>",
                        "created_utc": "2024-07-27 17:00:51",
                        "distinguished": null,
                        "edited": false,
                        "id": "lf9ippp",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf9bxn3",
                        "score": 3,
                        "stickied": false,
                        "replies": []
                      },
                      {
                        "author": "u/AutoModerator",
                        "body": "If this comment has been deleted, it is likely due to Reddit blacklisting the .RU domain. Post as text or find another source in an entirely new comment. This is a site wide issue, and not a choice of this CredibleDefense moderators.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CredibleDefense) if you have any questions or concerns.*",
                        "body_html": "<div class=\"md\"><p>If this comment has been deleted, it is likely due to Reddit blacklisting the .RU domain. Post as text or find another source in an entirely new comment. This is a site wide issue, and not a choice of this CredibleDefense moderators.</p>\n\n<p><em>I am a bot, and this action was performed automatically. Please <a href=\"/message/compose/?to=/r/CredibleDefense\">contact the moderators of this subreddit</a> if you have any questions or concerns.</em></p>\n</div>",
                        "created_utc": "2024-07-27 16:14:52",
                        "distinguished": "moderator",
                        "edited": false,
                        "id": "lf9bxxn",
                        "is_submitter": true,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf9bxn3",
                        "score": 1,
                        "stickied": false,
                        "replies": []
                      }
                    ]
                  },
                  {
                    "author": "[deleted]",
                    "body": "The service being down temporarily is a far cry from claiming the entire database and all it's backups were destroyed.",
                    "body_html": "<div class=\"md\"><p>The service being down temporarily is a far cry from claiming the entire database and all it&#39;s backups were destroyed.</p>\n</div>",
                    "created_utc": "2024-07-28 15:44:52",
                    "distinguished": null,
                    "edited": false,
                    "id": "lfelp1n",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf94c9g",
                    "score": 1,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "u/OpenOb",
        "body": "Major escalation at the Northern Front between Israel and Hezbollah.\n\nHezbollah launched around 100 rockets at civilian Israeli targets in Northern Israel. One rocket hit a soccer field in a Druze village.\n\nIsraeli media are already reporting killed in the attack:\n\n> Israeli media reports seven to nine people killed in the Hezbollah attack on Majdal Shams\n\nhttps://x.com/joetruzman/status/1817233040038560075?s=46&t=fc-rjYm09tzX-nreO-4qCA\n\n> The Magen David Adom ambulance service says nine victims of the rocket strike in Majdal Shams are in critical condition.\n\n> MDA says the victims are aged 10 to 20\n\nhttps://x.com/manniefabian/status/1817231149925580994?s=46&t=fc-rjYm09tzX-nreO-4qCA\n\nThe Druze of Northern Israel and the Golan have refused to evacuate and braced daily Hezbollah rocket attacks. The Israeli Druze are a highly integrated minority in Israel that serves in the IDF and has members in the Knesset, usually part of right wing parties.\n\n> The great concern over the last nine months of fighting was a mass casualty event caused by Hezbollah rocket fire. Israel has somehow avoided this scenario until today. There will be a response against Hezbollah.\n\nhttps://x.com/joetruzman/status/1817229536687468971?s=46&t=fc-rjYm09tzX-nreO-4qCA",
        "body_html": "<div class=\"md\"><p>Major escalation at the Northern Front between Israel and Hezbollah.</p>\n\n<p>Hezbollah launched around 100 rockets at civilian Israeli targets in Northern Israel. One rocket hit a soccer field in a Druze village.</p>\n\n<p>Israeli media are already reporting killed in the attack:</p>\n\n<blockquote>\n<p> Israeli media reports seven to nine people killed in the Hezbollah attack on Majdal Shams</p>\n</blockquote>\n\n<p><a href=\"https://x.com/joetruzman/status/1817233040038560075?s=46&amp;t=fc-rjYm09tzX-nreO-4qCA\">https://x.com/joetruzman/status/1817233040038560075?s=46&amp;t=fc-rjYm09tzX-nreO-4qCA</a></p>\n\n<blockquote>\n<p> The Magen David Adom ambulance service says nine victims of the rocket strike in Majdal Shams are in critical condition.</p>\n\n<p>MDA says the victims are aged 10 to 20</p>\n</blockquote>\n\n<p><a href=\"https://x.com/manniefabian/status/1817231149925580994?s=46&amp;t=fc-rjYm09tzX-nreO-4qCA\">https://x.com/manniefabian/status/1817231149925580994?s=46&amp;t=fc-rjYm09tzX-nreO-4qCA</a></p>\n\n<p>The Druze of Northern Israel and the Golan have refused to evacuate and braced daily Hezbollah rocket attacks. The Israeli Druze are a highly integrated minority in Israel that serves in the IDF and has members in the Knesset, usually part of right wing parties.</p>\n\n<blockquote>\n<p> The great concern over the last nine months of fighting was a mass casualty event caused by Hezbollah rocket fire. Israel has somehow avoided this scenario until today. There will be a response against Hezbollah.</p>\n</blockquote>\n\n<p><a href=\"https://x.com/joetruzman/status/1817229536687468971?s=46&amp;t=fc-rjYm09tzX-nreO-4qCA\">https://x.com/joetruzman/status/1817229536687468971?s=46&amp;t=fc-rjYm09tzX-nreO-4qCA</a></p>\n</div>",
        "created_utc": "2024-07-27 09:27:49",
        "distinguished": null,
        "edited": false,
        "id": "lf7ifu7",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 63,
        "stickied": false,
        "replies": [
          {
            "author": "u/iron_and_carbon",
            "body": "My understanding is that Israeli Syrian Druze from the Golan heights are much less integrated than Druze from the rest of Israeli with the majority refusing Israeli citizenship and thus not liable for conscription. The younger generation has been much more integrated and likely to take Israeli citizenship, this and the wider conflict will probably push them further into an Israeli identity ",
            "body_html": "<div class=\"md\"><p>My understanding is that Israeli Syrian Druze from the Golan heights are much less integrated than Druze from the rest of Israeli with the majority refusing Israeli citizenship and thus not liable for conscription. The younger generation has been much more integrated and likely to take Israeli citizenship, this and the wider conflict will probably push them further into an Israeli identity </p>\n</div>",
            "created_utc": "2024-07-27 18:29:50",
            "distinguished": null,
            "edited": false,
            "id": "lf9vixx",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf7ifu7",
            "score": 13,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/Tifoso89",
            "body": "And on an Arab town nonetheless.\n\nThis is a big escalation from Hezbollah. I imagine it could be tied to Hamas being under constant pressure in Gaza (there were reports that Egypt would be fine with Israeli control of the Gaza-Egypt border). Maybe they imagine the expected response from Israel might take some pressure off Gaza.\n\nI don't understand why hitting Majdal Shams. It's in the Golan, it's fully Druze Arab, they feel more Syrian than Israeli and only a minority of them (20-30%) has taken Israeli citizenship. Not exactly a stronghold of Israeli nationalism",
            "body_html": "<div class=\"md\"><p>And on an Arab town nonetheless.</p>\n\n<p>This is a big escalation from Hezbollah. I imagine it could be tied to Hamas being under constant pressure in Gaza (there were reports that Egypt would be fine with Israeli control of the Gaza-Egypt border). Maybe they imagine the expected response from Israel might take some pressure off Gaza.</p>\n\n<p>I don&#39;t understand why hitting Majdal Shams. It&#39;s in the Golan, it&#39;s fully Druze Arab, they feel more Syrian than Israeli and only a minority of them (20-30%) has taken Israeli citizenship. Not exactly a stronghold of Israeli nationalism</p>\n</div>",
            "created_utc": "2024-07-27 09:39:54",
            "distinguished": null,
            "edited": "2024-07-27 10:43:14",
            "id": "lf7kghh",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf7ifu7",
            "score": 32,
            "stickied": false,
            "replies": [
              {
                "author": "u/poincares_cook",
                "body": "The rocket barrage is not itself an escalation, such volume of fire against civilians Israeli towns is a normal for a few months now. Such strikes don't happen every day, but they do happen regularly.\n\nAs always with statistical weapons, luck plays a role. A major casualty evet was only a matter of time. The fact that they ended up hitting a bunch of kids does make it worse",
                "body_html": "<div class=\"md\"><p>The rocket barrage is not itself an escalation, such volume of fire against civilians Israeli towns is a normal for a few months now. Such strikes don&#39;t happen every day, but they do happen regularly.</p>\n\n<p>As always with statistical weapons, luck plays a role. A major casualty evet was only a matter of time. The fact that they ended up hitting a bunch of kids does make it worse</p>\n</div>",
                "created_utc": "2024-07-27 09:57:32",
                "distinguished": null,
                "edited": "2024-07-27 11:19:59",
                "id": "lf7neu2",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7kghh",
                "score": 14,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/jospence",
                    "body": "I think the most likely outcome is even more air strikes against Hezbollah and some special forces operations. It's been reported on that Israel has a fairly significant manpower shortage, even before the invasion of Gaza. I'm not sure they have enough manpower or readiness to conduct a full ground invasion of southern Lebanon, especially with the increased use of drones that can bypass iron dome defences. It would be very costly and terrible for Israel and Lebanon",
                    "body_html": "<div class=\"md\"><p>I think the most likely outcome is even more air strikes against Hezbollah and some special forces operations. It&#39;s been reported on that Israel has a fairly significant manpower shortage, even before the invasion of Gaza. I&#39;m not sure they have enough manpower or readiness to conduct a full ground invasion of southern Lebanon, especially with the increased use of drones that can bypass iron dome defences. It would be very costly and terrible for Israel and Lebanon</p>\n</div>",
                    "created_utc": "2024-07-27 12:13:32",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf8a4bt",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7neu2",
                    "score": 3,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/poincares_cook",
                        "body": "I don't believe that this even is sufficient to alter the Israeli \"strategy\" in Lebanon. In other words I don't expect an Israeli decision to enter a full scale war. \n\nAs you said, I expect air strikes, perhaps some against higher value targets, perhaps with more acceptance to civilian casualties in Lebanon (so far Israel has taken extreme care to avoid civilian casualties in Lebanon, only about 6-7% of those killed were civilians).\n\nThe manpower shortage is overblown for internal political reasons. It would be easier for Israel if there were more men, but neither is it restricting IDF operations. The vast majority of the 350k IDF reservists have returned home. That's a sufficient force for a war in Lebanon and then some.\n\n>especially with the increased use of drones that can bypass iron dome defences.\n\nThere are no drones that by pass iron dome, except FPV drones. As with every weapon system, Iron dome doesn't have a 100% success rate. Plus many strikes are conducted using valleys for approach bypassing the iron dome coverage. \n\nFull scale War with Hezbollah would be very costly for Israel no doubt, which is one of the main reasons Israel has not escalated the war Hezbollah started so far despite the ongoing attacks. Difficulty in formulating tangible goals is the other.",
                        "body_html": "<div class=\"md\"><p>I don&#39;t believe that this even is sufficient to alter the Israeli &quot;strategy&quot; in Lebanon. In other words I don&#39;t expect an Israeli decision to enter a full scale war. </p>\n\n<p>As you said, I expect air strikes, perhaps some against higher value targets, perhaps with more acceptance to civilian casualties in Lebanon (so far Israel has taken extreme care to avoid civilian casualties in Lebanon, only about 6-7% of those killed were civilians).</p>\n\n<p>The manpower shortage is overblown for internal political reasons. It would be easier for Israel if there were more men, but neither is it restricting IDF operations. The vast majority of the 350k IDF reservists have returned home. That&#39;s a sufficient force for a war in Lebanon and then some.</p>\n\n<blockquote>\n<p>especially with the increased use of drones that can bypass iron dome defences.</p>\n</blockquote>\n\n<p>There are no drones that by pass iron dome, except FPV drones. As with every weapon system, Iron dome doesn&#39;t have a 100% success rate. Plus many strikes are conducted using valleys for approach bypassing the iron dome coverage. </p>\n\n<p>Full scale War with Hezbollah would be very costly for Israel no doubt, which is one of the main reasons Israel has not escalated the war Hezbollah started so far despite the ongoing attacks. Difficulty in formulating tangible goals is the other.</p>\n</div>",
                        "created_utc": "2024-07-27 12:24:54",
                        "distinguished": null,
                        "edited": false,
                        "id": "lf8bxtj",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf8a4bt",
                        "score": 8,
                        "stickied": false,
                        "replies": []
                      }
                    ]
                  }
                ]
              },
              {
                "author": "u/Thoth_the_5th_of_Tho",
                "body": "> I don't understand why hitting Majdal Shams. It's in the Golan, it's fully Druze Arab, they feel more Syrian than Israeli and only a minority of them (20-30%) has taken Israeli citizenship. Not exactly a stronghold of Israeli nationalism\n\nIt was a non-evacuated town, within reach. It’s likely that Hezbollah believes an Israeli-Arab revolt is vanishingly unlikely, especially after Palestinian killed all Jewish, Arab, and Thai civilians they came across.\n\n> An expected response from Israel might take some pressure off Gaza.\n\nI don’t think it would change much. Most of what Israel has to do is occupy that corridor, and do some bombing and raids, neither of which are overwhelmingly manpower intensive.",
                "body_html": "<div class=\"md\"><blockquote>\n<p>I don&#39;t understand why hitting Majdal Shams. It&#39;s in the Golan, it&#39;s fully Druze Arab, they feel more Syrian than Israeli and only a minority of them (20-30%) has taken Israeli citizenship. Not exactly a stronghold of Israeli nationalism</p>\n</blockquote>\n\n<p>It was a non-evacuated town, within reach. It’s likely that Hezbollah believes an Israeli-Arab revolt is vanishingly unlikely, especially after Palestinian killed all Jewish, Arab, and Thai civilians they came across.</p>\n\n<blockquote>\n<p>An expected response from Israel might take some pressure off Gaza.</p>\n</blockquote>\n\n<p>I don’t think it would change much. Most of what Israel has to do is occupy that corridor, and do some bombing and raids, neither of which are overwhelmingly manpower intensive.</p>\n</div>",
                "created_utc": "2024-07-27 10:23:53",
                "distinguished": null,
                "edited": false,
                "id": "lf7rwmh",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7kghh",
                "score": 11,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/OpenOb",
                "body": ">Maybe they imagine the expected response from Israel might take some pressure off Gaza.\n\nFor the last few days there is a major operation going on. After the Israelis advanced towards the Humanitarian zone to recover the bodies of 5 hostages Israeli forces have rapidly advanced from Rafah and from Northern Khan Yunis towards each other and towards the Nasser hospital.\n\nThe latest rumor is that the body of Deif is either held in the Nasser hospital or the Namsawi cemetery. \n\nBut that operation is carried out by 4 to 5 brigades, that are part of Southern Command anyway. I doubt they would be flipped to Lebanon.",
                "body_html": "<div class=\"md\"><blockquote>\n<p>Maybe they imagine the expected response from Israel might take some pressure off Gaza.</p>\n</blockquote>\n\n<p>For the last few days there is a major operation going on. After the Israelis advanced towards the Humanitarian zone to recover the bodies of 5 hostages Israeli forces have rapidly advanced from Rafah and from Northern Khan Yunis towards each other and towards the Nasser hospital.</p>\n\n<p>The latest rumor is that the body of Deif is either held in the Nasser hospital or the Namsawi cemetery. </p>\n\n<p>But that operation is carried out by 4 to 5 brigades, that are part of Southern Command anyway. I doubt they would be flipped to Lebanon.</p>\n</div>",
                "created_utc": "2024-07-27 12:35:27",
                "distinguished": null,
                "edited": false,
                "id": "lf8dmyv",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7kghh",
                "score": 8,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/Rhauko",
                "body": "Hezbollah claims it wasn’t them https://www.cbc.ca/news/world/israel-hezbollah-strike-soccer-field-golan-heights-1.7277711.\n\nThere are plenty of other militant groups around in South Lebanon.",
                "body_html": "<div class=\"md\"><p>Hezbollah claims it wasn’t them <a href=\"https://www.cbc.ca/news/world/israel-hezbollah-strike-soccer-field-golan-heights-1.7277711\">https://www.cbc.ca/news/world/israel-hezbollah-strike-soccer-field-golan-heights-1.7277711</a>.</p>\n\n<p>There are plenty of other militant groups around in South Lebanon.</p>\n</div>",
                "created_utc": "2024-07-27 13:48:48",
                "distinguished": null,
                "edited": false,
                "id": "lf8plli",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7kghh",
                "score": -10,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/OpenOb",
                    "body": "They did claim the attack:\n\n[https://x.com/michaelh992/status/1817248428725809579](https://x.com/michaelh992/status/1817248428725809579)\n\nAnd nobody else is running around with rockets with a 50kg warhead\n\n>\"A Falaq-1 rocket struck here in the soccer field, it is an Iranian rocket, manufactured in Iran, a rocket with a warhead of over 50 kilograms of explosives,\" Hagari says in a press conference at the scene.\n\n>\"The forensic findings at the scene point to this rocket. Falaq-1 is only in use by the Hezbollah terror group, which carried out this attack from Chebaa,\" he says\n\n>Hezbollah in an earlier statement said it fired one Falaq rocket at an Israeli army base just north of Majdal Shams, and later denied attacking the town.\n\n[https://x.com/manniefabian/status/1817310269728592027](https://x.com/manniefabian/status/1817310269728592027)",
                    "body_html": "<div class=\"md\"><p>They did claim the attack:</p>\n\n<p><a href=\"https://x.com/michaelh992/status/1817248428725809579\">https://x.com/michaelh992/status/1817248428725809579</a></p>\n\n<p>And nobody else is running around with rockets with a 50kg warhead</p>\n\n<blockquote>\n<p>&quot;A Falaq-1 rocket struck here in the soccer field, it is an Iranian rocket, manufactured in Iran, a rocket with a warhead of over 50 kilograms of explosives,&quot; Hagari says in a press conference at the scene.</p>\n\n<p>&quot;The forensic findings at the scene point to this rocket. Falaq-1 is only in use by the Hezbollah terror group, which carried out this attack from Chebaa,&quot; he says</p>\n\n<p>Hezbollah in an earlier statement said it fired one Falaq rocket at an Israeli army base just north of Majdal Shams, and later denied attacking the town.</p>\n</blockquote>\n\n<p><a href=\"https://x.com/manniefabian/status/1817310269728592027\">https://x.com/manniefabian/status/1817310269728592027</a></p>\n</div>",
                    "created_utc": "2024-07-27 14:30:39",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf8w8j5",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8plli",
                    "score": 24,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/TSiNNmreza3",
            "body": "More than 30 casulties, the biggest civilian casulties after October 7th. \n\nI think this could be tipping point",
            "body_html": "<div class=\"md\"><p>More than 30 casulties, the biggest civilian casulties after October 7th. </p>\n\n<p>I think this could be tipping point</p>\n</div>",
            "created_utc": "2024-07-27 10:03:06",
            "distinguished": null,
            "edited": false,
            "id": "lf7ockd",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf7ifu7",
            "score": 32,
            "stickied": false,
            "replies": [
              {
                "author": "u/poincares_cook",
                "body": "Things may spiral out of control with both sides escalating against each other escalation. This will surely trigger a wave of harsher Israeli responses.\n\nThat said, I don't think there will be an Israeli decision to escalate to full scale war at the moment. Whatever calculus was in place before today remains the same. I don't believe Israel will go to full war over now unless it was waiting for a pretext, which in my personal opinion it was not.",
                "body_html": "<div class=\"md\"><p>Things may spiral out of control with both sides escalating against each other escalation. This will surely trigger a wave of harsher Israeli responses.</p>\n\n<p>That said, I don&#39;t think there will be an Israeli decision to escalate to full scale war at the moment. Whatever calculus was in place before today remains the same. I don&#39;t believe Israel will go to full war over now unless it was waiting for a pretext, which in my personal opinion it was not.</p>\n</div>",
                "created_utc": "2024-07-27 14:22:05",
                "distinguished": null,
                "edited": false,
                "id": "lf8uw6y",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7ockd",
                "score": 12,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/Goddamnit_Clown",
                "body": "Tipping over to what?",
                "body_html": "<div class=\"md\"><p>Tipping over to what?</p>\n</div>",
                "created_utc": "2024-07-27 13:15:12",
                "distinguished": null,
                "edited": false,
                "id": "lf8k2up",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7ockd",
                "score": 4,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/TSiNNmreza3",
                    "body": "For start of bigger air campaign and even ground operation \n\n13 People are confirmed dead",
                    "body_html": "<div class=\"md\"><p>For start of bigger air campaign and even ground operation </p>\n\n<p>13 People are confirmed dead</p>\n</div>",
                    "created_utc": "2024-07-27 13:17:46",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf8khzm",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8k2up",
                    "score": 12,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/poincares_cook",
            "body": "Majdal Shams is not in the evacuation zone, so that wouldn't have mattered anyway.",
            "body_html": "<div class=\"md\"><p>Majdal Shams is not in the evacuation zone, so that wouldn&#39;t have mattered anyway.</p>\n</div>",
            "created_utc": "2024-07-27 09:59:35",
            "distinguished": null,
            "edited": false,
            "id": "lf7nr77",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf7ifu7",
            "score": 6,
            "stickied": false,
            "replies": []
          }
        ]
      },
      {
        "author": "[deleted]",
        "body": "[deleted]",
        "body_html": "<div class=\"md\"><p>[deleted]</p>\n</div>",
        "created_utc": "2024-07-27 14:25:15",
        "distinguished": null,
        "edited": false,
        "id": "lf8ve1j",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 36,
        "stickied": false,
        "replies": [
          {
            "author": "u/ferrel_hadley",
            "body": ">These would incapacitate Israel’s electric grid and communication systems, disrupting radar, planes, and ground forces reliant on these systems. This would help turn the tide in Hezbollah’s favor in a future war, as Israeli ground forces would not have aerial cover or coordination.\"\n\nNon nuclear EMP devices exist. \n\n[https://en.wikipedia.org/wiki/Explosively\\_pumped\\_flux\\_compression\\_generator](https://en.wikipedia.org/wiki/Explosively_pumped_flux_compression_generator)\n\nBut you are relying on the power you can get from the chemicals in your warhead. Not sure you are going to get more out of one of these than hitting the substation or something with a chemical bomb using explosives. \n\nThe power grid can swallow lighting storms so you get a huge amount of energy to break it. They are really built to be resilient. \n\nIn terms of radars, well the big ground stations like Patriot come with 2 150 kW generators. They crank out huge amounts of power, aircraft with a 8 tonne carrying capacity dedicated to EW like the Growler can only really jam them from a certain distance away. So the idea that 500kg warhead on a rocket is going to be able to wreck the radar system of a whole country seems wildly implausible. \n\nThey seem to have conflated a not very useful conventional EMP with what happens when you detonate a nuclear weapon in the exosphere and you get some serious EMP on the ground.",
            "body_html": "<div class=\"md\"><blockquote>\n<p>These would incapacitate Israel’s electric grid and communication systems, disrupting radar, planes, and ground forces reliant on these systems. This would help turn the tide in Hezbollah’s favor in a future war, as Israeli ground forces would not have aerial cover or coordination.&quot;</p>\n</blockquote>\n\n<p>Non nuclear EMP devices exist. </p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Explosively_pumped_flux_compression_generator\">https://en.wikipedia.org/wiki/Explosively_pumped_flux_compression_generator</a></p>\n\n<p>But you are relying on the power you can get from the chemicals in your warhead. Not sure you are going to get more out of one of these than hitting the substation or something with a chemical bomb using explosives. </p>\n\n<p>The power grid can swallow lighting storms so you get a huge amount of energy to break it. They are really built to be resilient. </p>\n\n<p>In terms of radars, well the big ground stations like Patriot come with 2 150 kW generators. They crank out huge amounts of power, aircraft with a 8 tonne carrying capacity dedicated to EW like the Growler can only really jam them from a certain distance away. So the idea that 500kg warhead on a rocket is going to be able to wreck the radar system of a whole country seems wildly implausible. </p>\n\n<p>They seem to have conflated a not very useful conventional EMP with what happens when you detonate a nuclear weapon in the exosphere and you get some serious EMP on the ground.</p>\n</div>",
            "created_utc": "2024-07-27 14:48:34",
            "distinguished": null,
            "edited": false,
            "id": "lf8z1q0",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8ve1j",
            "score": 56,
            "stickied": false,
            "replies": [
              {
                "author": "u/jambox888",
                "body": "I don't really know what I'm talking about but is it possible that very high energy levels can be achieved over an extremely short time period?\n\nIf you think about it that's how camera flashes work from a small battery - can still blind someone temporarily. Although that would use a capacitor I think. Anyway it's not like chemical powered lasers where the difficulty is sustaining the emission for long enough to burn a hole or something.",
                "body_html": "<div class=\"md\"><p>I don&#39;t really know what I&#39;m talking about but is it possible that very high energy levels can be achieved over an extremely short time period?</p>\n\n<p>If you think about it that&#39;s how camera flashes work from a small battery - can still blind someone temporarily. Although that would use a capacitor I think. Anyway it&#39;s not like chemical powered lasers where the difficulty is sustaining the emission for long enough to burn a hole or something.</p>\n</div>",
                "created_utc": "2024-07-27 15:11:03",
                "distinguished": null,
                "edited": false,
                "id": "lf92hdv",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8z1q0",
                "score": 5,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/ferrel_hadley",
                    "body": "Its possible, its what the wikipedia article is about a system that can do that. But you will be limited to the energy you can get out of a warhead. Also electromagnetic energy drops with what is called the inverse square law. This is that for every change of distance d from the source you get, your get the 1/d^(2) energy. So at 2 times the distance you have 1/4 the energy and at 3 times the distance you get 1/9th the energy. So energy drops exponentially. You will only have a very short ranged effect. \n\nIts probably going to be a lot more effective to use an explosive than trying to kick out that same energy through electromagnetic wavelengths.",
                    "body_html": "<div class=\"md\"><p>Its possible, its what the wikipedia article is about a system that can do that. But you will be limited to the energy you can get out of a warhead. Also electromagnetic energy drops with what is called the inverse square law. This is that for every change of distance d from the source you get, your get the 1/d<sup>2</sup> energy. So at 2 times the distance you have 1/4 the energy and at 3 times the distance you get 1/9th the energy. So energy drops exponentially. You will only have a very short ranged effect. </p>\n\n<p>Its probably going to be a lot more effective to use an explosive than trying to kick out that same energy through electromagnetic wavelengths.</p>\n</div>",
                    "created_utc": "2024-07-27 15:31:17",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf95h95",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf92hdv",
                    "score": 17,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/jambox888",
                        "body": "Ah yes I missed the Wikipedia link, that does indeed explain it.\n\nRange I understand as a limiting factor but I suppose it also depends on how sensitive the target system is. \n\nAs far as I understand it, an EMP literally overheats the electronics in an affected system. OTOH you have things like solar flares which just induce high currents along wires. I can't see how you'd do either with one of the devices to be honest - just making a loud noise doesn't damage a microphone, as a simile",
                        "body_html": "<div class=\"md\"><p>Ah yes I missed the Wikipedia link, that does indeed explain it.</p>\n\n<p>Range I understand as a limiting factor but I suppose it also depends on how sensitive the target system is. </p>\n\n<p>As far as I understand it, an EMP literally overheats the electronics in an affected system. OTOH you have things like solar flares which just induce high currents along wires. I can&#39;t see how you&#39;d do either with one of the devices to be honest - just making a loud noise doesn&#39;t damage a microphone, as a simile</p>\n</div>",
                        "created_utc": "2024-07-27 16:11:10",
                        "distinguished": null,
                        "edited": false,
                        "id": "lf9beef",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf95h95",
                        "score": 2,
                        "stickied": false,
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "u/flamedeluge3781",
            "body": "> Does this seem credible or is this just bluster? \n\nPhysics says no.",
            "body_html": "<div class=\"md\"><blockquote>\n<p>Does this seem credible or is this just bluster? </p>\n</blockquote>\n\n<p>Physics says no.</p>\n</div>",
            "created_utc": "2024-07-27 14:35:47",
            "distinguished": null,
            "edited": false,
            "id": "lf8x1jz",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8ve1j",
            "score": 32,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/ABoutDeSouffle",
            "body": "I know nukes create an electromagnetic pulse that can disrupt all electronics, but how do you create this with conventional explosives? \n\nAnyhow, sounds like the usual chest beating by Iran.",
            "body_html": "<div class=\"md\"><p>I know nukes create an electromagnetic pulse that can disrupt all electronics, but how do you create this with conventional explosives? </p>\n\n<p>Anyhow, sounds like the usual chest beating by Iran.</p>\n</div>",
            "created_utc": "2024-07-27 14:39:08",
            "distinguished": null,
            "edited": false,
            "id": "lf8xksx",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8ve1j",
            "score": 13,
            "stickied": false,
            "replies": [
              {
                "author": "u/jambox888",
                "body": "Yeah no idea how you would shunt the energy released into EM radiation - could do it with a big battery perhaps? Imagine the camera flash on your phone but thousands of times more power behind it. But that's pure speculation.",
                "body_html": "<div class=\"md\"><p>Yeah no idea how you would shunt the energy released into EM radiation - could do it with a big battery perhaps? Imagine the camera flash on your phone but thousands of times more power behind it. But that&#39;s pure speculation.</p>\n</div>",
                "created_utc": "2024-07-27 15:15:17",
                "distinguished": null,
                "edited": false,
                "id": "lf934bm",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8xksx",
                "score": 3,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/OkSpecialist5770",
                "body": "Explosive flux compression",
                "body_html": "<div class=\"md\"><p>Explosive flux compression</p>\n</div>",
                "created_utc": "2024-07-28 03:24:21",
                "distinguished": null,
                "edited": false,
                "id": "lfbgeng",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8xksx",
                "score": 1,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/carkidd3242",
            "body": "High-energy microwave weapons can do it, but that wouldn't really fit as a 'warhead' for a rocket.",
            "body_html": "<div class=\"md\"><p>High-energy microwave weapons can do it, but that wouldn&#39;t really fit as a &#39;warhead&#39; for a rocket.</p>\n</div>",
            "created_utc": "2024-07-27 14:47:56",
            "distinguished": null,
            "edited": false,
            "id": "lf8yy5a",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8ve1j",
            "score": 11,
            "stickied": false,
            "replies": [
              {
                "author": "u/ferrel_hadley",
                "body": ">High-energy microwave weapons can do it\n\nCan you post an example of what you are talking about here? Just so we can get the correct system type you are talking about before going further.",
                "body_html": "<div class=\"md\"><blockquote>\n<p>High-energy microwave weapons can do it</p>\n</blockquote>\n\n<p>Can you post an example of what you are talking about here? Just so we can get the correct system type you are talking about before going further.</p>\n</div>",
                "created_utc": "2024-07-27 22:59:49",
                "distinguished": null,
                "edited": false,
                "id": "lfat1zw",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8yy5a",
                "score": 5,
                "stickied": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "u/Jamesonslime",
        "body": "That recent pentagon accounting where they found that they had overvalued equipment sent to Ukraine by 2billion and now have an extra 2 billion to send them has me wondering why the US hasn’t committed to Long term orders of F 16 for Ukraine to my knowledge the production line for that is exclusively for foreign customers at this point and with 2billion you could buy 31 new built F 16 block 70s ",
        "body_html": "<div class=\"md\"><p>That recent pentagon accounting where they found that they had overvalued equipment sent to Ukraine by 2billion and now have an extra 2 billion to send them has me wondering why the US hasn’t committed to Long term orders of F 16 for Ukraine to my knowledge the production line for that is exclusively for foreign customers at this point and with 2billion you could buy 31 new built F 16 block 70s </p>\n</div>",
        "created_utc": "2024-07-28 02:23:58",
        "distinguished": null,
        "edited": false,
        "id": "lfbbao5",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 21,
        "stickied": false,
        "replies": [
          {
            "author": "u/Thoth_the_5th_of_Tho",
            "body": "New built planes are going to be the slowest, most expensive option. \n\nI’d also note that while the newest planes have the best performance, a lot of that price is going towards that new airframe, designed to have enough flight hours to last decades. In Ukraine’s situation, even with intensive, wartime use, it’s doubtful the war or the plane will last that long. A slightly older fighter (that has most of the same features and can still launch stand off weapons), that has depreciated in value and has less flight hours left, may be better value for money.\n\nOn the subject of alacrity, keeping budgets down requires keeping timelines under control. The US has wasted an obscene amount of money dragging its feet on these deliveries. Likewise for every other weapon system that got bogged down in delays like this.",
            "body_html": "<div class=\"md\"><p>New built planes are going to be the slowest, most expensive option. </p>\n\n<p>I’d also note that while the newest planes have the best performance, a lot of that price is going towards that new airframe, designed to have enough flight hours to last decades. In Ukraine’s situation, even with intensive, wartime use, it’s doubtful the war or the plane will last that long. A slightly older fighter (that has most of the same features and can still launch stand off weapons), that has depreciated in value and has less flight hours left, may be better value for money.</p>\n\n<p>On the subject of alacrity, keeping budgets down requires keeping timelines under control. The US has wasted an obscene amount of money dragging its feet on these deliveries. Likewise for every other weapon system that got bogged down in delays like this.</p>\n</div>",
            "created_utc": "2024-07-28 02:33:27",
            "distinguished": null,
            "edited": false,
            "id": "lfbc2mu",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lfbbao5",
            "score": 35,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/Tamer_",
            "body": "What capability would Block 70 F-16 give Ukraine that they won't have with the AM/BM F-16s they will get?",
            "body_html": "<div class=\"md\"><p>What capability would Block 70 F-16 give Ukraine that they won&#39;t have with the AM/BM F-16s they will get?</p>\n</div>",
            "created_utc": "2024-07-29 17:52:54",
            "distinguished": null,
            "edited": false,
            "id": "lfku33y",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lfbbao5",
            "score": 1,
            "stickied": false,
            "replies": []
          }
        ]
      },
      {
        "author": "u/eric2332",
        "body": "Did I miss an earlier discussion of [this alleged incident](https://x.com/ChrisO_wiki/status/1816895244815991121)?\n\nReportedly one of Russia's Tu-160M bombers crashed in April, less than two months after Putin flew in the same plane. The crash was caused by an engine fault which was subsequently discovered in 10 other planes using the same engine. So the crash could easily have happened while Putin was flying, in which case it could have been interpreted as an intentional attack and lead to disastrous worldwide consequences.",
        "body_html": "<div class=\"md\"><p>Did I miss an earlier discussion of <a href=\"https://x.com/ChrisO_wiki/status/1816895244815991121\">this alleged incident</a>?</p>\n\n<p>Reportedly one of Russia&#39;s Tu-160M bombers crashed in April, less than two months after Putin flew in the same plane. The crash was caused by an engine fault which was subsequently discovered in 10 other planes using the same engine. So the crash could easily have happened while Putin was flying, in which case it could have been interpreted as an intentional attack and lead to disastrous worldwide consequences.</p>\n</div>",
        "created_utc": "2024-07-27 11:51:17",
        "distinguished": null,
        "edited": false,
        "id": "lf86jb7",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 28,
        "stickied": false,
        "replies": [
          {
            "author": "u/Lejeune_Dirichelet",
            "body": "Unlike the Soviet Union, Putin's regime is a personalistic one, if he suddenly dies Prigozhin-style it's unlikely that anybody in the ensuing scramble for power would care whether or not it was murder, and if yes, for what.",
            "body_html": "<div class=\"md\"><p>Unlike the Soviet Union, Putin&#39;s regime is a personalistic one, if he suddenly dies Prigozhin-style it&#39;s unlikely that anybody in the ensuing scramble for power would care whether or not it was murder, and if yes, for what.</p>\n</div>",
            "created_utc": "2024-07-27 12:56:44",
            "distinguished": null,
            "edited": false,
            "id": "lf8h2xx",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf86jb7",
            "score": 32,
            "stickied": false,
            "replies": [
              {
                "author": "u/ferrel_hadley",
                "body": ">Unlike the Soviet Union, Putin's regime is a personalistic one,\n\nId suggest that its more of an inner clique around the ex KGB inner circle of Bortnikov, Partruchev, Naryishkin, Sechin and so on.",
                "body_html": "<div class=\"md\"><blockquote>\n<p>Unlike the Soviet Union, Putin&#39;s regime is a personalistic one,</p>\n</blockquote>\n\n<p>Id suggest that its more of an inner clique around the ex KGB inner circle of Bortnikov, Partruchev, Naryishkin, Sechin and so on.</p>\n</div>",
                "created_utc": "2024-07-27 13:04:27",
                "distinguished": null,
                "edited": false,
                "id": "lf8ibtx",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf8h2xx",
                "score": 13,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Unidentified_Snail",
                    "body": "The inner-circle only matters though because of their influence on/access to Putin, Patrushev has no power-base, if Putin vanishes tomorrow Patrushev is nothing. Mark Galeotti explained this in a Q&A session after a recent talk he gave.    \n    \nhttps://youtu.be/cdY0Ndf_Ct4?t=3373    \n    \n@56:13",
                    "body_html": "<div class=\"md\"><p>The inner-circle only matters though because of their influence on/access to Putin, Patrushev has no power-base, if Putin vanishes tomorrow Patrushev is nothing. Mark Galeotti explained this in a Q&amp;A session after a recent talk he gave.    </p>\n\n<p><a href=\"https://youtu.be/cdY0Ndf_Ct4?t=3373\">https://youtu.be/cdY0Ndf_Ct4?t=3373</a>    </p>\n\n<p>@56:13</p>\n</div>",
                    "created_utc": "2024-07-27 15:34:14",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf95x6m",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf8ibtx",
                    "score": 11,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/Yaver_Mbizi",
                        "body": ">Patrushev has no power-base, if Putin vanishes tomorrow Patrushev is nothing. Mark Galeotti explained this in a Q&A session after a recent talk he gave. \n\nWhile that's probably right, Galeotti has a pretty bad track record with this sort of thing. He was at some panel with Yekaterina Shul'man not long before Wagner's mutiny, and was suggesting that Prigozhin is not a threat to Putin, doesn't have a real power base and that Putin could have him arrested at any moment. I think the events of the mutiny disproved that idea - he might have been unsuccessful, but he sure had a seemingly more solid powerbase than almost anybody else in the country.",
                        "body_html": "<div class=\"md\"><blockquote>\n<p>Patrushev has no power-base, if Putin vanishes tomorrow Patrushev is nothing. Mark Galeotti explained this in a Q&amp;A session after a recent talk he gave. </p>\n</blockquote>\n\n<p>While that&#39;s probably right, Galeotti has a pretty bad track record with this sort of thing. He was at some panel with Yekaterina Shul&#39;man not long before Wagner&#39;s mutiny, and was suggesting that Prigozhin is not a threat to Putin, doesn&#39;t have a real power base and that Putin could have him arrested at any moment. I think the events of the mutiny disproved that idea - he might have been unsuccessful, but he sure had a seemingly more solid powerbase than almost anybody else in the country.</p>\n</div>",
                        "created_utc": "2024-07-27 18:24:13",
                        "distinguished": null,
                        "edited": false,
                        "id": "lf9uqxo",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf95x6m",
                        "score": 1,
                        "stickied": false,
                        "replies": [
                          {
                            "author": "u/KingStannis2020",
                            "body": "Did he?  At least he thought he did, but it evaporated pretty quickly and it's not clear how much of that was by choice (once they realized what was going on) or by force.",
                            "body_html": "<div class=\"md\"><p>Did he?  At least he thought he did, but it evaporated pretty quickly and it&#39;s not clear how much of that was by choice (once they realized what was going on) or by force.</p>\n</div>",
                            "created_utc": "2024-07-27 19:02:05",
                            "distinguished": null,
                            "edited": false,
                            "id": "lfa00ly",
                            "is_submitter": false,
                            "link_id": "t3_1edeq4c",
                            "parent_id": "t1_lf9uqxo",
                            "score": 7,
                            "stickied": false,
                            "replies": []
                          },
                          {
                            "author": "u/OlivencaENossa",
                            "body": "I would have the opposite impression, that’s exactly what happened in the mutiny.",
                            "body_html": "<div class=\"md\"><p>I would have the opposite impression, that’s exactly what happened in the mutiny.</p>\n</div>",
                            "created_utc": "2024-07-29 03:37:27",
                            "distinguished": null,
                            "edited": false,
                            "id": "lfgv444",
                            "is_submitter": false,
                            "link_id": "t3_1edeq4c",
                            "parent_id": "t1_lf9uqxo",
                            "score": 1,
                            "stickied": false,
                            "replies": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "u/DotFit7119",
            "body": "And you as rational human person believe this very unsurprisingly suspicious source that more often than not is lying. I could with a bit of work on adobe photoshop and illustrator create a document that says kadirov is dying out of diarrhea and you would seriously trust that?",
            "body_html": "<div class=\"md\"><p>And you as rational human person believe this very unsurprisingly suspicious source that more often than not is lying. I could with a bit of work on adobe photoshop and illustrator create a document that says kadirov is dying out of diarrhea and you would seriously trust that?</p>\n</div>",
            "created_utc": "2024-07-27 13:14:18",
            "distinguished": null,
            "edited": false,
            "id": "lf8jxjb",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf86jb7",
            "score": 1,
            "stickied": false,
            "replies": []
          }
        ]
      },
      {
        "author": "u/permacultureplan4",
        "body": "Excellent article on national security risks from TikTok in a short Reddit thread. \nhttps://www.reddit.com/r/fucktheccp/comments/1bdqyce/why_us_banning_tiktok_is_a_good_thing_and_why/",
        "body_html": "<div class=\"md\"><p>Excellent article on national security risks from TikTok in a short Reddit thread. \n<a href=\"https://www.reddit.com/r/fucktheccp/comments/1bdqyce/why_us_banning_tiktok_is_a_good_thing_and_why/\">https://www.reddit.com/r/fucktheccp/comments/1bdqyce/why_us_banning_tiktok_is_a_good_thing_and_why/</a></p>\n</div>",
        "created_utc": "2024-07-27 13:36:57",
        "distinguished": null,
        "edited": false,
        "id": "lf8nncf",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 12,
        "stickied": false,
        "replies": [
          {
            "author": "u/Galthur",
            "body": "The only contents of substance seems to be:\n\n>TikTok is owned by Bytedance\n\n>Bytedance is a Chinese owned company\n\n>As a Chinese company, Bytedance is legally required to hand over all data to the CCP upon request\n\n>The CCP is a hostile authoritarian regime that could use the data to cause disruption to Western stability and infrustructure, and subvert Western democratic institutions...\n\nWhich is effectively saying there's a risk of another Cambridge Analytica happening. But without addressing the matter being true for effectively all social media platforms when it comes to purchasing data still allowing this. Further this risk comes across from all governments (China, US, Russia, etc) as there's lots of evidence all try to manipulate social media. As a result this just seems like a post hoc justification for TikTok specifically when legislation should be getting passed for all social media to mitigate this type of stuff by increasing privacy protections. \n\nThen again the subreddit is called 'fucktheccp' and they started this with:\n\n>TikTok isn't \"just an app\" allowing for quirky expression, it's a tool and medium of war\n\nIf the issue is as serious as some claim and the issue is inherent to practically all the social media apps, either way more Chinese ownership correlated apps (rip Reddit) should be getting banned or data protections laws should be getting added. Neither of which look to be planned... Personally I think the ban is mostly corruption/populism",
            "body_html": "<div class=\"md\"><p>The only contents of substance seems to be:</p>\n\n<blockquote>\n<p>TikTok is owned by Bytedance</p>\n\n<p>Bytedance is a Chinese owned company</p>\n\n<p>As a Chinese company, Bytedance is legally required to hand over all data to the CCP upon request</p>\n\n<p>The CCP is a hostile authoritarian regime that could use the data to cause disruption to Western stability and infrustructure, and subvert Western democratic institutions...</p>\n</blockquote>\n\n<p>Which is effectively saying there&#39;s a risk of another Cambridge Analytica happening. But without addressing the matter being true for effectively all social media platforms when it comes to purchasing data still allowing this. Further this risk comes across from all governments (China, US, Russia, etc) as there&#39;s lots of evidence all try to manipulate social media. As a result this just seems like a post hoc justification for TikTok specifically when legislation should be getting passed for all social media to mitigate this type of stuff by increasing privacy protections. </p>\n\n<p>Then again the subreddit is called &#39;fucktheccp&#39; and they started this with:</p>\n\n<blockquote>\n<p>TikTok isn&#39;t &quot;just an app&quot; allowing for quirky expression, it&#39;s a tool and medium of war</p>\n</blockquote>\n\n<p>If the issue is as serious as some claim and the issue is inherent to practically all the social media apps, either way more Chinese ownership correlated apps (rip Reddit) should be getting banned or data protections laws should be getting added. Neither of which look to be planned... Personally I think the ban is mostly corruption/populism</p>\n</div>",
            "created_utc": "2024-07-27 16:30:21",
            "distinguished": null,
            "edited": "2024-07-27 17:04:54",
            "id": "lf9e8id",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8nncf",
            "score": 22,
            "stickied": false,
            "replies": [
              {
                "author": "u/permacultureplan4",
                "body": "That is an interesting take on it and I agree with you. We do see attempts to regulate social media, TT and Facebook for having an adverse effect on subscribers, especially young ones but nothing ever seems to happen. Those behind such reforms are talking about specific tools used by those SM platforms that can lead to mind manipulation. \n\nWhat I really wanted to post about was the much earlier article I read at Reddit on the technical aspects of TikTok user data mining and ever increasing circles of surveillance leading to overlaps with other users contributing to massive amounts of data stored on CCP computer systems to be analyzed to reveal area demographics, behavior patters and much more, also geolocation data. Say for example a TT user has a relative with a friend in the DoD. Somewhere, sometime classified data might be revealed innocently which causes an alert notification on CCP computers. The author of the article had looked at the TT code and reported on its features as regards security issues. He then referred to another article about a skilled IT person who had analyzed the code in great detail to see what it enabled TT to do with user date. He deferred to this article for the final word on TT risks. So it looks like TT can collect massive amounts of data from a billion users to enter in a database which can be used by the CCP to learn who, what, when, wher, who their friends are and where they are located. Grand surveillance of a nation's population for use by their military. This goes well beyond mind manipulation by social media platforms. Of course you could always say that all US social media is under contract to US government intelligence agencies. Personally, I don't have a problem with that. With China it is different as they could use these tools to wage war on us.",
                "body_html": "<div class=\"md\"><p>That is an interesting take on it and I agree with you. We do see attempts to regulate social media, TT and Facebook for having an adverse effect on subscribers, especially young ones but nothing ever seems to happen. Those behind such reforms are talking about specific tools used by those SM platforms that can lead to mind manipulation. </p>\n\n<p>What I really wanted to post about was the much earlier article I read at Reddit on the technical aspects of TikTok user data mining and ever increasing circles of surveillance leading to overlaps with other users contributing to massive amounts of data stored on CCP computer systems to be analyzed to reveal area demographics, behavior patters and much more, also geolocation data. Say for example a TT user has a relative with a friend in the DoD. Somewhere, sometime classified data might be revealed innocently which causes an alert notification on CCP computers. The author of the article had looked at the TT code and reported on its features as regards security issues. He then referred to another article about a skilled IT person who had analyzed the code in great detail to see what it enabled TT to do with user date. He deferred to this article for the final word on TT risks. So it looks like TT can collect massive amounts of data from a billion users to enter in a database which can be used by the CCP to learn who, what, when, wher, who their friends are and where they are located. Grand surveillance of a nation&#39;s population for use by their military. This goes well beyond mind manipulation by social media platforms. Of course you could always say that all US social media is under contract to US government intelligence agencies. Personally, I don&#39;t have a problem with that. With China it is different as they could use these tools to wage war on us.</p>\n</div>",
                "created_utc": "2024-07-27 17:37:39",
                "distinguished": null,
                "edited": "2024-07-27 17:53:44",
                "id": "lf9o9af",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf9e8id",
                "score": -1,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/PresentationOk9649",
                    "body": ">Of course you could always say that all US social media is under contract to US government intelligence agencies. Personally, I don't have a problem with that.\n\nSo, in all this the tl;dr is \"The spying isn't bad when WE do it\"?",
                    "body_html": "<div class=\"md\"><blockquote>\n<p>Of course you could always say that all US social media is under contract to US government intelligence agencies. Personally, I don&#39;t have a problem with that.</p>\n</blockquote>\n\n<p>So, in all this the tl;dr is &quot;The spying isn&#39;t bad when WE do it&quot;?</p>\n</div>",
                    "created_utc": "2024-07-28 12:39:54",
                    "distinguished": null,
                    "edited": false,
                    "id": "lfdrirv",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf9o9af",
                    "score": 2,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/permacultureplan4",
                        "body": "Yes. You know in advance that this is happening so, no problem. It doesn't seem to be particularly evil. It could be though in the wrong hands like if the yellow cheeto went wild and certain elements of our population became victims of a US \"Dirty War\" like Argentina's. Then they would use social media to find those they want to disappear. Of course a modern version of the DW would look entirely different.",
                        "body_html": "<div class=\"md\"><p>Yes. You know in advance that this is happening so, no problem. It doesn&#39;t seem to be particularly evil. It could be though in the wrong hands like if the yellow cheeto went wild and certain elements of our population became victims of a US &quot;Dirty War&quot; like Argentina&#39;s. Then they would use social media to find those they want to disappear. Of course a modern version of the DW would look entirely different.</p>\n</div>",
                        "created_utc": "2024-07-28 16:49:33",
                        "distinguished": null,
                        "edited": "2024-07-28 23:02:13",
                        "id": "lfevfc9",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lfdrirv",
                        "score": 1,
                        "stickied": false,
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "u/OGRESHAVELAYERz",
            "body": "If you're getting your info from a subreddit where one of the front page posts is a...raceplay fetish post with an entire webpage attached to it, you're going to have a hard time distinguishing reality from (absolutely deranged) fiction.",
            "body_html": "<div class=\"md\"><p>If you&#39;re getting your info from a subreddit where one of the front page posts is a...raceplay fetish post with an entire webpage attached to it, you&#39;re going to have a hard time distinguishing reality from (absolutely deranged) fiction.</p>\n</div>",
            "created_utc": "2024-07-27 17:44:14",
            "distinguished": null,
            "edited": false,
            "id": "lf9p7nd",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8nncf",
            "score": 18,
            "stickied": false,
            "replies": [
              {
                "author": "u/permacultureplan4",
                "body": "If you are interested in such topics as data security on the Internet you take what you find for face value when you find it. It's about the content of the article not where it was posted or who typically reads that sub. I am interested in content first; it is either useful or not.To me this post was a rare find to be bookmarked and saved to email. I am sure there are many more like it on the Internet but finding them is another matter.",
                "body_html": "<div class=\"md\"><p>If you are interested in such topics as data security on the Internet you take what you find for face value when you find it. It&#39;s about the content of the article not where it was posted or who typically reads that sub. I am interested in content first; it is either useful or not.To me this post was a rare find to be bookmarked and saved to email. I am sure there are many more like it on the Internet but finding them is another matter.</p>\n</div>",
                "created_utc": "2024-07-27 18:14:43",
                "distinguished": null,
                "edited": false,
                "id": "lf9tgau",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf9p7nd",
                "score": 5,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/IntroductionNeat2746",
            "body": "The problem with this kind of threat is that for the average user, this is just a harmless social media app and any attempt to tell them otherwise will almost always be deemed as politically motivated fear mongering.\n\nAt the end of the day, most people would rather be blind fully ignorant than deal with the uncomfortable truths, be it the current state of geopolitics or the severity of the climate change problem.",
            "body_html": "<div class=\"md\"><p>The problem with this kind of threat is that for the average user, this is just a harmless social media app and any attempt to tell them otherwise will almost always be deemed as politically motivated fear mongering.</p>\n\n<p>At the end of the day, most people would rather be blind fully ignorant than deal with the uncomfortable truths, be it the current state of geopolitics or the severity of the climate change problem.</p>\n</div>",
            "created_utc": "2024-07-27 16:00:09",
            "distinguished": null,
            "edited": false,
            "id": "lf99rnr",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8nncf",
            "score": 5,
            "stickied": false,
            "replies": [
              {
                "author": "u/ausernamethatistoolo",
                "body": "I fundamentally agree and I also agree that tiktok should be banned, but it's also more than just being harmless. If you tell young people about the risks that China poses, a lot of them simply don't care. They don't see china as a serious threat.",
                "body_html": "<div class=\"md\"><p>I fundamentally agree and I also agree that tiktok should be banned, but it&#39;s also more than just being harmless. If you tell young people about the risks that China poses, a lot of them simply don&#39;t care. They don&#39;t see china as a serious threat.</p>\n</div>",
                "created_utc": "2024-07-27 16:19:06",
                "distinguished": null,
                "edited": false,
                "id": "lf9ckku",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf99rnr",
                "score": 0,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/permacultureplan4",
                    "body": "Young people have a right to not care about any China threat but eventually they will want to become well informed about their country and geopolitics. This should be part of their education, grade by grade. Not indoctrination but credible information leading to specialization and careers. The original article I read talked about how the TT code was a weapon of war, not just mind manipulation but in depth data mining of users and their friends that would be useful in a war situation.",
                    "body_html": "<div class=\"md\"><p>Young people have a right to not care about any China threat but eventually they will want to become well informed about their country and geopolitics. This should be part of their education, grade by grade. Not indoctrination but credible information leading to specialization and careers. The original article I read talked about how the TT code was a weapon of war, not just mind manipulation but in depth data mining of users and their friends that would be useful in a war situation.</p>\n</div>",
                    "created_utc": "2024-07-27 18:07:20",
                    "distinguished": null,
                    "edited": "2024-07-28 07:17:50",
                    "id": "lf9sfts",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf9ckku",
                    "score": 3,
                    "stickied": false,
                    "replies": []
                  }
                ]
              },
              {
                "author": "u/permacultureplan4",
                "body": "That is true and describes me and many others but a large number of younger generations will be taken in with it's intrusion into their lives and molded by it. I suspect that similar tactics are used by the yellow cheeto to gain popularity and votes. With TikTok the Chinese have thrown out a huge number of fishhooks and left them in the water indefinitely,. The question is should it be banned as a national security risk. The yellow one is now saying to his Christians to vote and if he gets elected they won't have to vote again, he will have fixed that problem (by replacing our Democracy with his authoritarian dictatorship). Should he be banned from running? Chinese goals with TikTok are the same. Fortunately as you say most people just watch and ignore it.\nI suppose when the votes are counted that is when you see the difference.",
                "body_html": "<div class=\"md\"><p>That is true and describes me and many others but a large number of younger generations will be taken in with it&#39;s intrusion into their lives and molded by it. I suspect that similar tactics are used by the yellow cheeto to gain popularity and votes. With TikTok the Chinese have thrown out a huge number of fishhooks and left them in the water indefinitely,. The question is should it be banned as a national security risk. The yellow one is now saying to his Christians to vote and if he gets elected they won&#39;t have to vote again, he will have fixed that problem (by replacing our Democracy with his authoritarian dictatorship). Should he be banned from running? Chinese goals with TikTok are the same. Fortunately as you say most people just watch and ignore it.\nI suppose when the votes are counted that is when you see the difference.</p>\n</div>",
                "created_utc": "2024-07-27 16:42:32",
                "distinguished": null,
                "edited": "2024-07-27 16:50:14",
                "id": "lf9g10q",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf99rnr",
                "score": -2,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/permacultureplan4",
            "body": "Earlier I found another Reddit article that went into the programming aspects of these risks and the author pointed to one with a much deeper analysis of the code some IT expert had done. Some people don't think this is a trivial issue at all. Maybe some just shrug it off. Mind manipulation, propaganda and mass attitude changes in the public. I don't have a link to that article but a Reddit search might reveal it.",
            "body_html": "<div class=\"md\"><p>Earlier I found another Reddit article that went into the programming aspects of these risks and the author pointed to one with a much deeper analysis of the code some IT expert had done. Some people don&#39;t think this is a trivial issue at all. Maybe some just shrug it off. Mind manipulation, propaganda and mass attitude changes in the public. I don&#39;t have a link to that article but a Reddit search might reveal it.</p>\n</div>",
            "created_utc": "2024-07-27 13:43:41",
            "distinguished": null,
            "edited": false,
            "id": "lf8or4h",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf8nncf",
            "score": 8,
            "stickied": false,
            "replies": []
          }
        ]
      },
      {
        "author": "u/Arlovant",
        "body": "It might be a hard question to answer, but how would you rate Syrskiy's performance as the Commander-in-Chief so far? Especially comparing him to Zaluzhniy.",
        "body_html": "<div class=\"md\"><p>It might be a hard question to answer, but how would you rate Syrskiy&#39;s performance as the Commander-in-Chief so far? Especially comparing him to Zaluzhniy.</p>\n</div>",
        "created_utc": "2024-07-27 15:09:32",
        "distinguished": null,
        "edited": false,
        "id": "lf92956",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 3,
        "stickied": false,
        "replies": []
      },
      {
        "author": "u/AdhesivenessisWeird",
        "body": "What is the general assessment of guided AT weapons like NLAW or Javelins moving forward? Seems like it is a very expensive system that is gradually being phased out because of the limitations to its effective range compared to drones + considering the danger to the operator, especially in case of NLAW.",
        "body_html": "<div class=\"md\"><p>What is the general assessment of guided AT weapons like NLAW or Javelins moving forward? Seems like it is a very expensive system that is gradually being phased out because of the limitations to its effective range compared to drones + considering the danger to the operator, especially in case of NLAW.</p>\n</div>",
        "created_utc": "2024-07-27 17:34:41",
        "distinguished": null,
        "edited": false,
        "id": "lf9nu3v",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": 6,
        "stickied": false,
        "replies": [
          {
            "author": "u/Old_Wallaby_7461",
            "body": "NLAW is a personal weapon that the individual soldier uses for defense or very short range attack. It is not comparable to a drone or even a bigger ATGM- it is more like a fancy AT4.",
            "body_html": "<div class=\"md\"><p>NLAW is a personal weapon that the individual soldier uses for defense or very short range attack. It is not comparable to a drone or even a bigger ATGM- it is more like a fancy AT4.</p>\n</div>",
            "created_utc": "2024-07-27 18:09:38",
            "distinguished": null,
            "edited": false,
            "id": "lf9sr2w",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf9nu3v",
            "score": 24,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/Thoth_the_5th_of_Tho",
            "body": "1. An NLAW or Javelin can go from detecting the enemy, to launching, to impact, in the matter of seconds. A small drone needs to be set up, take off, then fly towards the enemy, at a much slower speed, taking far more time per engagement.\n\n2. This applies primarily to Javelin, but the warhead is much larger. A correlated metal shed around the tank is usually enough to fend off most FPVs. That does basically nothing to an ATGM.  The same applies to most ERA and composite armor. The ATGM is also far more likely to destroy, rather than lightly damage, what it hits.\n\n3. The NLAW and Javelin aren’t effected by drone jamming equipment. They don’t require a signal going back to the operator that can be cut, or be used to reveal the position of the operator.\n\n4. NLAWs and Javelins can operate in all weather conditions, most FPVs can’t even fly at night.",
            "body_html": "<div class=\"md\"><ol>\n<li><p>An NLAW or Javelin can go from detecting the enemy, to launching, to impact, in the matter of seconds. A small drone needs to be set up, take off, then fly towards the enemy, at a much slower speed, taking far more time per engagement.</p></li>\n<li><p>This applies primarily to Javelin, but the warhead is much larger. A correlated metal shed around the tank is usually enough to fend off most FPVs. That does basically nothing to an ATGM.  The same applies to most ERA and composite armor. The ATGM is also far more likely to destroy, rather than lightly damage, what it hits.</p></li>\n<li><p>The NLAW and Javelin aren’t effected by drone jamming equipment. They don’t require a signal going back to the operator that can be cut, or be used to reveal the position of the operator.</p></li>\n<li><p>NLAWs and Javelins can operate in all weather conditions, most FPVs can’t even fly at night.</p></li>\n</ol>\n</div>",
            "created_utc": "2024-07-27 19:08:14",
            "distinguished": null,
            "edited": false,
            "id": "lfa0vis",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf9nu3v",
            "score": 66,
            "stickied": false,
            "replies": [
              {
                "author": "u/obsessed_doomer",
                "body": "> A correlated metal shed around the tank is usually enough to fend off most FPVs.\n\nNot just FPVs, it also is frequently sufficient to soften the blow against heavier loiterers like a Lancet.",
                "body_html": "<div class=\"md\"><blockquote>\n<p>A correlated metal shed around the tank is usually enough to fend off most FPVs.</p>\n</blockquote>\n\n<p>Not just FPVs, it also is frequently sufficient to soften the blow against heavier loiterers like a Lancet.</p>\n</div>",
                "created_utc": "2024-07-27 20:11:11",
                "distinguished": null,
                "edited": false,
                "id": "lfa9eox",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lfa0vis",
                "score": 19,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/ishouldvent",
            "body": "? Man portable AT weapons are very much still in demand, probably even more than before due to the constant armoured assaults near Avdiivka.\n\nCope cages and all types of slat armour may seem funny, but theyre actually effective against drones. And theres the jamming factor.  Both basically non-factors for modern AT missiles with tandem charges.\n\nPlus, what are you going to do if youre an infantryman in charge of defending a trench, and a tank is 500m away?",
            "body_html": "<div class=\"md\"><p>? Man portable AT weapons are very much still in demand, probably even more than before due to the constant armoured assaults near Avdiivka.</p>\n\n<p>Cope cages and all types of slat armour may seem funny, but theyre actually effective against drones. And theres the jamming factor.  Both basically non-factors for modern AT missiles with tandem charges.</p>\n\n<p>Plus, what are you going to do if youre an infantryman in charge of defending a trench, and a tank is 500m away?</p>\n</div>",
            "created_utc": "2024-07-27 17:40:34",
            "distinguished": null,
            "edited": false,
            "id": "lf9ood1",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf9nu3v",
            "score": 16,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/Fatalist_m",
            "body": "Drones are cheap when they are made using COTS components and without any gold plating in a decentralized manner where the free market prevents price-gauging. Drones made by the same large US corporations that make guided missiles and with the same profit-oriented mindset won't necessarily be cheaper than missiles. The cheapest US-made kamikaze drone is Switchblade-300 at about $50k. The cheapest US-made guided missile(that I know of) is APKWS, costing  20 to 40k. Why Western guided munitions are so expensive is another discussion and I won't go into that here but my point is that rocket-propelled munitions should not be significantly more expensive than battery-powered ones.\n\nAs for the capabilities, many of them are independent of the propulsion method, for example:\n\n\\* There are ATGMs that have a long range and non-LOS capability like the SPIKE family, sometimes called 5th gen ATGMs.  Most of them are controlled with a fiber cable. The longest-range SPIKEs have ranges up to 50km and are controlled with a radio link - like drones, and in theory jammable like drones;\n\n\\* Small(ish) drones don't necessarily have a small warhead, the new 15-inch quadcopter from Wild Hornets can take a  6kg payload to 17km and costs $1000  [source](https://mil.in.ua/en/news/the-largest-queen-hornets-fpv-drone-was-presented-in-ukraine/)\n\n\\* There are drones with thermal cameras, target-locking functionality, and will have more and more autonomy in the future.\n\nThe main principle difference is whether you prefer speed or loitering time. Speed is pretty valuable so rocket-propelled AT weapons are not going anywhere.",
            "body_html": "<div class=\"md\"><p>Drones are cheap when they are made using COTS components and without any gold plating in a decentralized manner where the free market prevents price-gauging. Drones made by the same large US corporations that make guided missiles and with the same profit-oriented mindset won&#39;t necessarily be cheaper than missiles. The cheapest US-made kamikaze drone is Switchblade-300 at about $50k. The cheapest US-made guided missile(that I know of) is APKWS, costing  20 to 40k. Why Western guided munitions are so expensive is another discussion and I won&#39;t go into that here but my point is that rocket-propelled munitions should not be significantly more expensive than battery-powered ones.</p>\n\n<p>As for the capabilities, many of them are independent of the propulsion method, for example:</p>\n\n<p>* There are ATGMs that have a long range and non-LOS capability like the SPIKE family, sometimes called 5th gen ATGMs.  Most of them are controlled with a fiber cable. The longest-range SPIKEs have ranges up to 50km and are controlled with a radio link - like drones, and in theory jammable like drones;</p>\n\n<p>* Small(ish) drones don&#39;t necessarily have a small warhead, the new 15-inch quadcopter from Wild Hornets can take a  6kg payload to 17km and costs $1000  <a href=\"https://mil.in.ua/en/news/the-largest-queen-hornets-fpv-drone-was-presented-in-ukraine/\">source</a></p>\n\n<p>* There are drones with thermal cameras, target-locking functionality, and will have more and more autonomy in the future.</p>\n\n<p>The main principle difference is whether you prefer speed or loitering time. Speed is pretty valuable so rocket-propelled AT weapons are not going anywhere.</p>\n</div>",
            "created_utc": "2024-07-28 07:27:46",
            "distinguished": null,
            "edited": false,
            "id": "lfc9m8q",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf9nu3v",
            "score": 9,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/ferrel_hadley",
            "body": "They are successful because no one has really spent a lot of money countering them yet. The physics of tracking and hitting it is not hard. \n\nDrones are very slow so you will easily be able to get a kinetic solution, even something as simple as a machine gun on the roof wired to a radar. And modern APS systems should be able to deal with them with ease so long as they are not set to ignore things that move that slow. \n\nThey are also going to be very prone to decent electronic warfare. Radio guidance for weapons has been a thing since Fritz X in 1943. Its not new and it was quickly jammed then, they will be jammed again.",
            "body_html": "<div class=\"md\"><p>They are successful because no one has really spent a lot of money countering them yet. The physics of tracking and hitting it is not hard. </p>\n\n<p>Drones are very slow so you will easily be able to get a kinetic solution, even something as simple as a machine gun on the roof wired to a radar. And modern APS systems should be able to deal with them with ease so long as they are not set to ignore things that move that slow. </p>\n\n<p>They are also going to be very prone to decent electronic warfare. Radio guidance for weapons has been a thing since Fritz X in 1943. Its not new and it was quickly jammed then, they will be jammed again.</p>\n</div>",
            "created_utc": "2024-07-27 17:50:05",
            "distinguished": null,
            "edited": false,
            "id": "lf9q1bo",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf9nu3v",
            "score": 10,
            "stickied": false,
            "replies": []
          }
        ]
      },
      {
        "author": "u/PatientArm559",
        "body": "After two and a half years of war, Russia is still going strong, helped by a good economy due to high oil and gas prices. Although Russia's military was weaker than expected, they can keep fighting in Ukraine for a long time as long as they have the money. It doesn't seem possible for Ukraine to beat Russia on the battlefield with its current economy.  So it makes sense to try to take out its main source of income: oil\n\nPerhaps this might be a naive question, but is it possible for the U.S. to increase oil extraction by expanding drilling efforts, as suggested by Trump's campaign?\n\nUnder Biden, the US reached its highest oil production level, currently at 13.30 million barrels per day. However, it was during Trump's administration that production increased from 9 million to 13 million barrels per day. Therefore, I think Trump would be more likely to continue supporting policies that boost oil production.\n\nNot a Trump fan, nor I am knowledgeable about US politics.",
        "body_html": "<div class=\"md\"><p>After two and a half years of war, Russia is still going strong, helped by a good economy due to high oil and gas prices. Although Russia&#39;s military was weaker than expected, they can keep fighting in Ukraine for a long time as long as they have the money. It doesn&#39;t seem possible for Ukraine to beat Russia on the battlefield with its current economy.  So it makes sense to try to take out its main source of income: oil</p>\n\n<p>Perhaps this might be a naive question, but is it possible for the U.S. to increase oil extraction by expanding drilling efforts, as suggested by Trump&#39;s campaign?</p>\n\n<p>Under Biden, the US reached its highest oil production level, currently at 13.30 million barrels per day. However, it was during Trump&#39;s administration that production increased from 9 million to 13 million barrels per day. Therefore, I think Trump would be more likely to continue supporting policies that boost oil production.</p>\n\n<p>Not a Trump fan, nor I am knowledgeable about US politics.</p>\n</div>",
        "created_utc": "2024-07-27 08:04:48",
        "distinguished": null,
        "edited": false,
        "id": "lf74e3f",
        "is_submitter": false,
        "link_id": "t3_1edeq4c",
        "parent_id": "t3_1edeq4c",
        "score": -32,
        "stickied": false,
        "replies": [
          {
            "author": "u/Mach0__",
            "body": "As others have said, there’s not much else that government could really do. US oil is already booming, it’s already become the #1 producer worldwide and served to blunt OPEC cuts. Any attempts to dial that up any further will start running into hard limits like lack of refinery capacity, worker/equipment shortages, etc.",
            "body_html": "<div class=\"md\"><p>As others have said, there’s not much else that government could really do. US oil is already booming, it’s already become the #1 producer worldwide and served to blunt OPEC cuts. Any attempts to dial that up any further will start running into hard limits like lack of refinery capacity, worker/equipment shortages, etc.</p>\n</div>",
            "created_utc": "2024-07-27 09:33:02",
            "distinguished": null,
            "edited": false,
            "id": "lf7jaya",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf74e3f",
            "score": 31,
            "stickied": false,
            "replies": [
              {
                "author": "u/PatientArm559",
                "body": "They can always use refinery from other countries that sit idle. We have a few in Romania(thanks Ceausescu) who would probably be much cheaper amd faster to restart than building a new one in US. I am sure other countries from eastern europe would love the idea as well",
                "body_html": "<div class=\"md\"><p>They can always use refinery from other countries that sit idle. We have a few in Romania(thanks Ceausescu) who would probably be much cheaper amd faster to restart than building a new one in US. I am sure other countries from eastern europe would love the idea as well</p>\n</div>",
                "created_utc": "2024-07-27 10:55:02",
                "distinguished": null,
                "edited": false,
                "id": "lf7x8lq",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7jaya",
                "score": 9,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Agitated-Airline6760",
                    "body": "> They can always use refinery from other countries that sit idle. We have a few in Romania(thanks Ceausescu) who would probably be much cheaper amd faster to restart than building a new one in US. I am sure other countries from eastern europe would love the idea as well\n\nIf a refinery is set up to process Ural crude which is heavy sour crude, then that refinery will need significant changes - it's not economically feasible - before it could refine US fracking crude which is sweet/light crude.  One of the main reason why US still imports as much crude as it exports is because the US refineries are not set up to refine the US fracking crude.",
                    "body_html": "<div class=\"md\"><blockquote>\n<p>They can always use refinery from other countries that sit idle. We have a few in Romania(thanks Ceausescu) who would probably be much cheaper amd faster to restart than building a new one in US. I am sure other countries from eastern europe would love the idea as well</p>\n</blockquote>\n\n<p>If a refinery is set up to process Ural crude which is heavy sour crude, then that refinery will need significant changes - it&#39;s not economically feasible - before it could refine US fracking crude which is sweet/light crude.  One of the main reason why US still imports as much crude as it exports is because the US refineries are not set up to refine the US fracking crude.</p>\n</div>",
                    "created_utc": "2024-07-27 11:47:32",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf85xaq",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7x8lq",
                    "score": 17,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/karim12100",
            "body": "The ceiling on oil and gas production isn’t the number of oil rigs, it’s refining capacity and that’s basically stagnant. Building a large refinery takes tens of billions of dollars and close to a decade and none of the major refinery companies is willing to do that since the long term outlook on consumption isn’t great.",
            "body_html": "<div class=\"md\"><p>The ceiling on oil and gas production isn’t the number of oil rigs, it’s refining capacity and that’s basically stagnant. Building a large refinery takes tens of billions of dollars and close to a decade and none of the major refinery companies is willing to do that since the long term outlook on consumption isn’t great.</p>\n</div>",
            "created_utc": "2024-07-27 08:45:29",
            "distinguished": null,
            "edited": false,
            "id": "lf7bb8o",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf74e3f",
            "score": 19,
            "stickied": false,
            "replies": [
              {
                "author": "u/PatientArm559",
                "body": "But why not use refineries from other european countries. Like send us oil in Romania and we will refiny it for you. We have refineries that sit idle. Will take a year or two to restart, but ffs it it feasible. I  am sure other eastern european countries would love to do this",
                "body_html": "<div class=\"md\"><p>But why not use refineries from other european countries. Like send us oil in Romania and we will refiny it for you. We have refineries that sit idle. Will take a year or two to restart, but ffs it it feasible. I  am sure other eastern european countries would love to do this</p>\n</div>",
                "created_utc": "2024-07-27 10:43:53",
                "distinguished": null,
                "edited": false,
                "id": "lf7vbr8",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7bb8o",
                "score": 6,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/qwamqwamqwam2",
            "body": ">Although Russia's military was weaker than expected, they can keep fighting in Ukraine for a long time as long as they have the money.\n\nRussia cannot continue to lose 30,000 troops per month in exchange for marginal advances. That is not a sustainable casualty rate for a war of choice being fought mere kilometers from the 2014 front lines in some areas. Something has to break, and it won't be oil production.",
            "body_html": "<div class=\"md\"><blockquote>\n<p>Although Russia&#39;s military was weaker than expected, they can keep fighting in Ukraine for a long time as long as they have the money.</p>\n</blockquote>\n\n<p>Russia cannot continue to lose 30,000 troops per month in exchange for marginal advances. That is not a sustainable casualty rate for a war of choice being fought mere kilometers from the 2014 front lines in some areas. Something has to break, and it won&#39;t be oil production.</p>\n</div>",
            "created_utc": "2024-07-27 09:07:09",
            "distinguished": null,
            "edited": false,
            "id": "lf7f08r",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf74e3f",
            "score": 42,
            "stickied": false,
            "replies": [
              {
                "author": "u/Thoth_the_5th_of_Tho",
                "body": "Hardware losses are also far too high to be sustainable. New production is not enough to meet demand, and those stockpiles are starting to run dry in important categories. Deteriorating hardware leads to worse casualties, which makes it even harder for new production to keep up, and getting new recruits more and more expensive.\n\nWars of attrition are not the situation in which you want to stay on the offensive no matter what.",
                "body_html": "<div class=\"md\"><p>Hardware losses are also far too high to be sustainable. New production is not enough to meet demand, and those stockpiles are starting to run dry in important categories. Deteriorating hardware leads to worse casualties, which makes it even harder for new production to keep up, and getting new recruits more and more expensive.</p>\n\n<p>Wars of attrition are not the situation in which you want to stay on the offensive no matter what.</p>\n</div>",
                "created_utc": "2024-07-27 11:07:25",
                "distinguished": null,
                "edited": false,
                "id": "lf7zbxt",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7f08r",
                "score": 26,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/Suspicious_Loads",
                "body": "The question is if Russia an sustainan longer than Ukraine. As Ukraine is in more severe draft than Russia the answer is probably yes.",
                "body_html": "<div class=\"md\"><p>The question is if Russia an sustainan longer than Ukraine. As Ukraine is in more severe draft than Russia the answer is probably yes.</p>\n</div>",
                "created_utc": "2024-07-27 14:12:45",
                "distinguished": null,
                "edited": false,
                "id": "lf8tex2",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7f08r",
                "score": 12,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/Hellibor",
                "body": "30k per month? What is the source of this?",
                "body_html": "<div class=\"md\"><p>30k per month? What is the source of this?</p>\n</div>",
                "created_utc": "2024-07-27 20:34:15",
                "distinguished": null,
                "edited": false,
                "id": "lfacbwb",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7f08r",
                "score": 1,
                "stickied": false,
                "replies": []
              },
              {
                "author": "u/worldofecho__",
                "body": "The manpower advantage is heavily in Russia's favour. So long as Russia isn't losing wildly more troops than Ukraine, which I don't believe it is, then this becomes a critical problem for Ukraine long before it does for Russia.",
                "body_html": "<div class=\"md\"><p>The manpower advantage is heavily in Russia&#39;s favour. So long as Russia isn&#39;t losing wildly more troops than Ukraine, which I don&#39;t believe it is, then this becomes a critical problem for Ukraine long before it does for Russia.</p>\n</div>",
                "created_utc": "2024-07-27 09:26:51",
                "distinguished": null,
                "edited": false,
                "id": "lf7ia4e",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf7f08r",
                "score": -11,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/plasticlove",
                    "body": "t's getting harder and harder for Russia to recruit. Payments for contract soldiers in the Moscow region have tripled in a year and they are also doing \"refer a friend\" bonuses now.\n\n\nThey don't have endless manpower unless they do another round of mobilization.",
                    "body_html": "<div class=\"md\"><p>t&#39;s getting harder and harder for Russia to recruit. Payments for contract soldiers in the Moscow region have tripled in a year and they are also doing &quot;refer a friend&quot; bonuses now.</p>\n\n<p>They don&#39;t have endless manpower unless they do another round of mobilization.</p>\n</div>",
                    "created_utc": "2024-07-27 10:16:15",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7qlpp",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7ia4e",
                    "score": 22,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/sponsoredcommenter",
                        "body": "So in other words, Ukraine is on their six millionth round of mobilization, increasingly scraping the barrel as the recent bill they passed shows, but Russia practically hasn't even started.",
                        "body_html": "<div class=\"md\"><p>So in other words, Ukraine is on their six millionth round of mobilization, increasingly scraping the barrel as the recent bill they passed shows, but Russia practically hasn&#39;t even started.</p>\n</div>",
                        "created_utc": "2024-07-27 11:48:30",
                        "distinguished": null,
                        "edited": "2024-07-27 11:51:36",
                        "id": "lf86306",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf7qlpp",
                        "score": -17,
                        "stickied": false,
                        "replies": []
                      }
                    ]
                  },
                  {
                    "author": "u/qwamqwamqwam2",
                    "body": "What you \"believe\" doesn't matter. Every credible source states that, at present, Russia's casualty rate far exceeds Ukraine's. I'm not going to go in a circle relitigating a debate that has been done to death. For Ukraine, this is a war of survival. For Russia, this is a war of choice. Autocracies may have limited avenues and higher thresholds for dissent, but even the Soviet Union could not sustain an expeditionary campaign with limited strategic significance, and that war had a far lower casualty rate than this one.",
                    "body_html": "<div class=\"md\"><p>What you &quot;believe&quot; doesn&#39;t matter. Every credible source states that, at present, Russia&#39;s casualty rate far exceeds Ukraine&#39;s. I&#39;m not going to go in a circle relitigating a debate that has been done to death. For Ukraine, this is a war of survival. For Russia, this is a war of choice. Autocracies may have limited avenues and higher thresholds for dissent, but even the Soviet Union could not sustain an expeditionary campaign with limited strategic significance, and that war had a far lower casualty rate than this one.</p>\n</div>",
                    "created_utc": "2024-07-27 10:39:07",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7ui9p",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7ia4e",
                    "score": 17,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "u/jrex035",
            "body": "Trump himself had little if anything to do with increased US oil production, that was more about improvements in fracking and global oil demand supporting increased production. \n\nRegardless, even if Trump was responsible for it and did manage to ramp up production in a second term, he and his running mate are vehemently opposed to providing aid to Ukraine and are campaigning on essentially forcing Ukraine to surrender. \n\nSo the point is moot anyway.",
            "body_html": "<div class=\"md\"><p>Trump himself had little if anything to do with increased US oil production, that was more about improvements in fracking and global oil demand supporting increased production. </p>\n\n<p>Regardless, even if Trump was responsible for it and did manage to ramp up production in a second term, he and his running mate are vehemently opposed to providing aid to Ukraine and are campaigning on essentially forcing Ukraine to surrender. </p>\n\n<p>So the point is moot anyway.</p>\n</div>",
            "created_utc": "2024-07-27 08:19:15",
            "distinguished": null,
            "edited": false,
            "id": "lf76t0h",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf74e3f",
            "score": 23,
            "stickied": false,
            "replies": [
              {
                "author": "u/PatientArm559",
                "body": "I would rather have European alone send military aid to Ukraine, and US focus on dumping oil on the market to make oil 45-50$. Without money, Russian economy will be destroyed by inflation, and you will see war support drop",
                "body_html": "<div class=\"md\"><p>I would rather have European alone send military aid to Ukraine, and US focus on dumping oil on the market to make oil 45-50$. Without money, Russian economy will be destroyed by inflation, and you will see war support drop</p>\n</div>",
                "created_utc": "2024-07-27 10:51:33",
                "distinguished": null,
                "edited": false,
                "id": "lf7wnab",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf76t0h",
                "score": -9,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/CrankyCyclist",
                    "body": "The problem is that many US oil producers would be losing money if they had to sell their oil at $45-50.  The US doesn't have a managed economy, the President can't just force oil companies to pump a certain quota of oil out of the ground.\n\nThe increase in production in the US was caused by higher prices, allowing more US oil producers to make a good profit.",
                    "body_html": "<div class=\"md\"><p>The problem is that many US oil producers would be losing money if they had to sell their oil at $45-50.  The US doesn&#39;t have a managed economy, the President can&#39;t just force oil companies to pump a certain quota of oil out of the ground.</p>\n\n<p>The increase in production in the US was caused by higher prices, allowing more US oil producers to make a good profit.</p>\n</div>",
                    "created_utc": "2024-07-27 12:19:16",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf8b1n7",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7wnab",
                    "score": 13,
                    "stickied": false,
                    "replies": [
                      {
                        "author": "u/PatientArm559",
                        "body": "It can't force them, but it can heavily subsidize them. In the EU, even if the spot energy price goes negative, renewable energy can still make money through government contracts guaranteeing a minimum subsidy. Why do this? To gain leverage over OPEC+ countries. You negotiate with them, threatening to flood the market with oil if they don't increase their production quotas. You also offer better deals to countries that buy from Russia, including benefits that Russia can't provide.",
                        "body_html": "<div class=\"md\"><p>It can&#39;t force them, but it can heavily subsidize them. In the EU, even if the spot energy price goes negative, renewable energy can still make money through government contracts guaranteeing a minimum subsidy. Why do this? To gain leverage over OPEC+ countries. You negotiate with them, threatening to flood the market with oil if they don&#39;t increase their production quotas. You also offer better deals to countries that buy from Russia, including benefits that Russia can&#39;t provide.</p>\n</div>",
                        "created_utc": "2024-07-27 12:26:09",
                        "distinguished": null,
                        "edited": false,
                        "id": "lf8c521",
                        "is_submitter": false,
                        "link_id": "t3_1edeq4c",
                        "parent_id": "t1_lf8b1n7",
                        "score": -1,
                        "stickied": false,
                        "replies": [
                          {
                            "author": "u/CrankyCyclist",
                            "body": "Do you think heavily subsidizing oil companies (more than they already are) would be a popular political position in the USA?",
                            "body_html": "<div class=\"md\"><p>Do you think heavily subsidizing oil companies (more than they already are) would be a popular political position in the USA?</p>\n</div>",
                            "created_utc": "2024-07-27 21:21:29",
                            "distinguished": null,
                            "edited": false,
                            "id": "lfai7j1",
                            "is_submitter": false,
                            "link_id": "t3_1edeq4c",
                            "parent_id": "t1_lf8c521",
                            "score": 1,
                            "stickied": false,
                            "replies": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "author": "u/-spartacus-",
            "body": "I don't know if it is accurate, but I was watching a podcast the other day, and someone who worked in the oil industry a few years back said the US has more oil it can produce than it can refine.  So while the US can produce more oil it might not have a big impact, but that data could be old.",
            "body_html": "<div class=\"md\"><p>I don&#39;t know if it is accurate, but I was watching a podcast the other day, and someone who worked in the oil industry a few years back said the US has more oil it can produce than it can refine.  So while the US can produce more oil it might not have a big impact, but that data could be old.</p>\n</div>",
            "created_utc": "2024-07-27 08:12:46",
            "distinguished": null,
            "edited": false,
            "id": "lf75pya",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf74e3f",
            "score": 8,
            "stickied": false,
            "replies": []
          },
          {
            "author": "u/plasticlove",
            "body": ">they can keep fighting in Ukraine for a long time as long as they have the money\n\nWhat is that based on? There are many scenarios where they can't keep fighting even if they still have money. Where will they buy military equipment when they run low on their Soviet-era stockpile? Recruitment is getting harder and harder, even with very high sign-on bonuses.",
            "body_html": "<div class=\"md\"><blockquote>\n<p>they can keep fighting in Ukraine for a long time as long as they have the money</p>\n</blockquote>\n\n<p>What is that based on? There are many scenarios where they can&#39;t keep fighting even if they still have money. Where will they buy military equipment when they run low on their Soviet-era stockpile? Recruitment is getting harder and harder, even with very high sign-on bonuses.</p>\n</div>",
            "created_utc": "2024-07-27 08:18:09",
            "distinguished": null,
            "edited": false,
            "id": "lf76mf0",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf74e3f",
            "score": 14,
            "stickied": false,
            "replies": [
              {
                "author": "u/PatientArm559",
                "body": "Dont overestimate your enemy.",
                "body_html": "<div class=\"md\"><p>Dont overestimate your enemy.</p>\n</div>",
                "created_utc": "2024-07-27 10:47:52",
                "distinguished": null,
                "edited": false,
                "id": "lf7w0jv",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf76mf0",
                "score": -6,
                "stickied": false,
                "replies": []
              }
            ]
          },
          {
            "author": "u/Tricky-Astronaut",
            "body": "The West absolutely should ramp up oil and gas production as much as possible, and it's sad to see Labour pledging to stop giving new licenses in the North Sea. This might even be bad for the environment if the UK gets replaced by dirtier producers.\n\n\nHowever, there's a second part of the equation: demand. If you increase supply and also increase demand, then you have essentially done nothing to change the global balance. Excessive production needs to be combined with demand destruction.\n\n\nNorway has by far the best policies in this regard, but Biden isn't that far behind. He did increase production and he's also reducing demand. Both parts are equally important!",
            "body_html": "<div class=\"md\"><p>The West absolutely should ramp up oil and gas production as much as possible, and it&#39;s sad to see Labour pledging to stop giving new licenses in the North Sea. This might even be bad for the environment if the UK gets replaced by dirtier producers.</p>\n\n<p>However, there&#39;s a second part of the equation: demand. If you increase supply and also increase demand, then you have essentially done nothing to change the global balance. Excessive production needs to be combined with demand destruction.</p>\n\n<p>Norway has by far the best policies in this regard, but Biden isn&#39;t that far behind. He did increase production and he&#39;s also reducing demand. Both parts are equally important!</p>\n</div>",
            "created_utc": "2024-07-27 08:30:22",
            "distinguished": null,
            "edited": false,
            "id": "lf78pw6",
            "is_submitter": false,
            "link_id": "t3_1edeq4c",
            "parent_id": "t1_lf74e3f",
            "score": 11,
            "stickied": false,
            "replies": [
              {
                "author": "u/worldofecho__",
                "body": "It is absurdly short-sighted to say that it is \"sad\" that the UK's Labour government is pledging to stop awarding new licences to drill for oil and gas in the North Sea. Climate change is a far greater threat to the UK and, indeed, to the rest of the world than Russia's invasion of Ukraine, so to think that countries should give up on attempting to mitigate the climate crisis is wrongheaded. \n\nAnd in any case, countries like the UK becoming more energy independent through investing in renewable energy, rather than a futile attempt to become self-sufficient depending on fossil fuel, achieves the same short-term national security objectives anyway.",
                "body_html": "<div class=\"md\"><p>It is absurdly short-sighted to say that it is &quot;sad&quot; that the UK&#39;s Labour government is pledging to stop awarding new licences to drill for oil and gas in the North Sea. Climate change is a far greater threat to the UK and, indeed, to the rest of the world than Russia&#39;s invasion of Ukraine, so to think that countries should give up on attempting to mitigate the climate crisis is wrongheaded. </p>\n\n<p>And in any case, countries like the UK becoming more energy independent through investing in renewable energy, rather than a futile attempt to become self-sufficient depending on fossil fuel, achieves the same short-term national security objectives anyway.</p>\n</div>",
                "created_utc": "2024-07-27 09:31:19",
                "distinguished": null,
                "edited": false,
                "id": "lf7j0pv",
                "is_submitter": false,
                "link_id": "t3_1edeq4c",
                "parent_id": "t1_lf78pw6",
                "score": 2,
                "stickied": false,
                "replies": [
                  {
                    "author": "u/Tricky-Astronaut",
                    "body": "Replacing UK fossil fuels with ones from Russia certainly won't help with climate change. This is one of the worst forms of outsourcing. Methane leaks are a huge problem in this industry, and guess with countries couldn't care less...\n\n\nFurthermore, I don't see the UK switching away from gas heating given how overtaxed electricity is, so the UK will need gas from somewhere. Nowadays even Germany is better with taxation.",
                    "body_html": "<div class=\"md\"><p>Replacing UK fossil fuels with ones from Russia certainly won&#39;t help with climate change. This is one of the worst forms of outsourcing. Methane leaks are a huge problem in this industry, and guess with countries couldn&#39;t care less...</p>\n\n<p>Furthermore, I don&#39;t see the UK switching away from gas heating given how overtaxed electricity is, so the UK will need gas from somewhere. Nowadays even Germany is better with taxation.</p>\n</div>",
                    "created_utc": "2024-07-27 09:41:32",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7kqbr",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7j0pv",
                    "score": 7,
                    "stickied": false,
                    "replies": []
                  },
                  {
                    "author": "u/PatientArm559",
                    "body": "You can have renewable at home, and also sell oil to countries that still use it to take money from Russia you know",
                    "body_html": "<div class=\"md\"><p>You can have renewable at home, and also sell oil to countries that still use it to take money from Russia you know</p>\n</div>",
                    "created_utc": "2024-07-27 10:47:05",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf7vvru",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7j0pv",
                    "score": 4,
                    "stickied": false,
                    "replies": []
                  },
                  {
                    "author": "u/NoGarlic2387",
                    "body": "Russia's success in Ukraine might lead to a WW3 which would be much worse for the world than even the most extreme currently projected Climate Change scenarios. ",
                    "body_html": "<div class=\"md\"><p>Russia&#39;s success in Ukraine might lead to a WW3 which would be much worse for the world than even the most extreme currently projected Climate Change scenarios. </p>\n</div>",
                    "created_utc": "2024-07-27 13:47:11",
                    "distinguished": null,
                    "edited": false,
                    "id": "lf8pc2c",
                    "is_submitter": false,
                    "link_id": "t3_1edeq4c",
                    "parent_id": "t1_lf7j0pv",
                    "score": 1,
                    "stickied": false,
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}